{
  "lastUpdated": "2026-01-30T19:48:18.859Z",
  "headline": {
    "title": "\"Prevent the Bloodshed\": Filmmaker Sepideh Farsi on Iran Protests & U.S. Threats of Military Strikes",
    "link": "http://www.democracynow.org/2026/1/30/iran",
    "content": "The latest reliable estimates of the death toll in Iran’s recent nationwide protests are growing, potentially reaching the tens of thousands. Some estimates place the number of civilians killed by government forces at 30,000 or more. We play a rare eyewitness account of the deadly massacre of protesters in Rasht, Iran, and speak to the Iranian filmmaker and political dissident Sepideh Farsi, who says U.S. military intervention “would only worsen the situation.” She warns that President Trump’s interest in U.S. military action on the country is “for business,” and “not for Iranian people.”",
    "pubDate": "Fri, 30 Jan 2026 08:50:17 -0500",
    "source": "Democracy Now!",
    "summary": "• The latest reliable estimates of the death toll in Iran’s recent nationwide protests are growing, potentially reaching the tens of thousands. Some estimates place the number of civilians killed by gov...",
    "summarizedAt": "2026-01-30T19:48:15.728Z",
    "sensationalismScore": 74.03281694444445
  },
  "articles": [
    {
      "title": "\"Prevent the Bloodshed\": Filmmaker Sepideh Farsi on Iran Protests & U.S. Threats of Military Strikes",
      "link": "http://www.democracynow.org/2026/1/30/iran",
      "content": "The latest reliable estimates of the death toll in Iran’s recent nationwide protests are growing, potentially reaching the tens of thousands. Some estimates place the number of civilians killed by government forces at 30,000 or more. We play a rare eyewitness account of the deadly massacre of protesters in Rasht, Iran, and speak to the Iranian filmmaker and political dissident Sepideh Farsi, who says U.S. military intervention “would only worsen the situation.” She warns that President Trump’s interest in U.S. military action on the country is “for business,” and “not for Iranian people.”",
      "pubDate": "Fri, 30 Jan 2026 08:50:17 -0500",
      "source": "Democracy Now!",
      "summary": "• The latest reliable estimates of the death toll in Iran’s recent nationwide protests are growing, potentially reaching the tens of thousands. Some estimates place the number of civilians killed by gov...",
      "summarizedAt": "2026-01-30T19:48:15.728Z",
      "sensationalismScore": 74.03281694444445
    },
    {
      "title": "House Progressives Unveil 'Defund the Oligarchs, Fund the People' Resolution",
      "link": "https://www.commondreams.org/news/trump-oligarchs",
      "content": "As President Donald Trump continues to serve billionaires over working people and degrade the US economy, a trio of progressive congresswomen on Friday introduced the Defund the Oligarchs, Fund the People Resolution.\n\"Trump promised to lower costs for families on day one, but a year since he took office, grocery, housing, and healthcare costs are out of control,\" said Rep. Rashida Tlaib (D-Mich.), who is leading the measure with Congresswomen Pramila Jayapal (D-Wash.) and Delia Ramirez (D-Ill.). Rep. Summer Lee (D-Pa.) is an original co-sponsor.\nTlaib took aim at Trump and Republicans who control both chambers of Congress for forcing through their so-called One Big Beautiful Bill Act last year: \"He signed into law the largest cuts to healthcare and food assistance in the history of our country, all to give trillions of dollars in tax breaks to his rich donors and their massive corporations.\"\n\"Meanwhile, 60% of Americans are living paycheck to paycheck, and CEOs are making 281 times more than their average worker,\" she stressed. \"It's time to tax the rich, defund the oligarchy, and invest those funds in the needs of working families.\"\n\"Every dollar that gets plundered by billionaires through tax breaks, corporate giveaways, and political favoritism is a dollar that is taken away from healthcare, housing, education, and good jobs.\"\nThe resolution declares that \"the United States was created to be a democracy, founded on the principle that all people are created equal, governed not by kings or corporate masters but by themselves as free citizens,\" and \"the gravest threat to democracy and individual freedoms is the alliance of private wealth and authoritarian government.\"\nAt various moments over the past 250 years, Americans have \"sounded the alarm\" over oligarchy and the federal government \"has vigorously combated excessive concentrations of power and wealth,\" the measure notes. However, in recent decades, the government \"has forfeited its role safeguarding democracy.\"\nThe resolution highlights that the combined wealth of the country's 900 billionaires exceeds that of the 67,000,000 households in the poorest 50%, as working people contend with stagnant wages and struggle to afford everything from healthcare to housing. Trump notably said during a Thursday Cabinet meeting that \"I don't want to drive housing prices down, I want to drive housing prices up for people that own their homes. And they can be assured that's what's going to happen.\"\n\n\n\n\nWhile many measures introduced by progressives don't even receive votes in the GOP-controlled Congress, this one is especially unlikely to go anywhere, given that it explicitly calls out not only the superrich donors who use their money to control the US political system but also the president, whom many lawmakers in his party are afraid to criticize.\nBlasting \"the quid pro quo\" between Trump and the ultrawealthy oligarchs and corporations, the resolution emphasizes that they \"are corrupting United States politics through billions in open and hidden campaign contributions and by exploiting their monopoly control in key sectors of the economy, and especially over media, information, and emerging digital technologies.\" \n\"Trump has permitted pay-to-play schemes to become endemic, as oligarchs leverage political contributions to win hundreds of billions in taxpayer-funded federal subsidies, tax breaks, regulatory rollbacks, and government contracts despite exploiting workers and polluting communities,\" it continues, specifically pointing to spending by the fossil fuel, tech, and cryptocurrency industries.\n\"Public funds belong to the people of the United States and should be invested in education, healthcare, housing, clean energy, and infrastructure, not used to enrich the wealthiest individuals and most powerful corporations,\" the resolution argues. It also expresses concern about a decline in union membership that \"has diminished the ability of the labor movement\" to continue its \"significant historical role in counteracting corporate power, reducing inequality, and ensuring the political system is responsive to the interests of ordinary Americans, not just wealthy elites.\"\nThe resolution includes various demands for the president and Congress. It says that Trump \"must not reward oligarchs and billionaire-controlled corporations with lucrative, publicly funded contracts, loans, and grants\" when they engage in corrupt scheming, fail to fairly compete in open markets, and break federal laws.\nIt also says that the president and Congress must: \n\nAct with all deliberate speed to protect election integrity;\nBreak up all concentrations of economic and political power;\nDrastically reduce levels of economic inequality and concentrations of inherited wealth;\nReform the Supreme Court;\nSupport the dramatic expansion of unions;\nExplore ways to promote alternative, noncorporate forms of ownership; and\nUse public money to fund programs that raise the standard of living.\n\n\"While working families have to choose between paying rent, buying groceries, or keeping the heat on, billionaires are just getting richer,\" said Jayapal. \"We must rein in corporate power by breaking up monopolies and reforming campaign finance laws.\" \n\"It's time to make billionaires pay their fair share of taxes and reinvest those funds to provide for our communities—housing, healthcare, and education,\" she continued. \"Our resolution calls for a political and economic system that benefits working families, not one that enriches the ultrawealthy.\"\nThe resolution comes just months before the midterm elections and amid pressure on Democrats to prove they can offer a true alternative to Trump's government full of loyalists, weak labor market, persistently high inflation, and tax giveaways to the rich—including Elon Musk, a former presidential adviser and the richest person on the planet. \nSome of that pressure has come from the grassroots group Our Revolution, which is backing the resolution alongside organizations including Americans for Tax Fairness, Climate and Community Institute, MoveOn, National Nurses United, Patriotic Millionaires, People's Action, Public Citizen, RootsAction, and Social Security Works.\n\"Every dollar that gets plundered by billionaires through tax breaks, corporate giveaways, and political favoritism is a dollar that is taken away from healthcare, housing, education, and good jobs. That is not just corruption, it is a betrayal of who government is supposed to serve, and it is why so many people feel that democracy is not working for them,\" said Our Revolution executive director Joseph Geevarghese.\n\"The truth is, none of the policies working families are fighting for can ever fully materialize as long as corporate money and billionaire influence are writing the rules,\" he added. \"Lawmakers cannot keep pretending to serve both the corporate class and working families at the same time. If we want real progress on wages, healthcare, housing, and climate, cutting off corporate corruption and reinvesting in our communities has to be part of how we govern, not just something we talk about during elections.\"",
      "pubDate": "Fri, 30 Jan 2026 18:47:32 +0000",
      "source": "Common Dreams",
      "summary": "• As President Donald Trump continues to serve billionaires over working people and degrade the US economy, a trio of progressive congresswomen on Friday introduced the Defund the Oligarchs, Fund the Pe...",
      "summarizedAt": "2026-01-30T19:48:07.130Z",
      "sensationalismScore": 58.986983611111114
    },
    {
      "title": "Federal Authorities Arrest Don Lemon Over Filming of Church Protest",
      "link": "https://truthout.org/articles/federal-authorities-arrest-don-lemon-over-filming-of-church-protest/",
      "content": "Lemon's lawyer called his arrest an “attack” on press freedom and a distraction from “crises” the administration faces.",
      "pubDate": "Fri, 30 Jan 2026 18:35:38 +0000",
      "source": "Truthout",
      "summary": "• Lemon's lawyer called his arrest an “attack” on press freedom and a distraction from “crises” the administration faces....",
      "summarizedAt": "2026-01-30T19:48:08.254Z",
      "sensationalismScore": 58.788650277777776
    },
    {
      "title": "‘Most Dangerous Attack on Voting Rights Ever’? New GOP Election Bill Sparks Dire Warnings",
      "link": "https://www.commondreams.org/news/republican-voting-rights",
      "content": "The Republican chairman of the House committee that oversees federal elections introduced legislation on Thursday that one analyst characterized as possibly \"the most dangerous attack on voting rights ever\" put forth in the US Congress.\nLed by Rep. Bryan Steil (R-Wis.), chair of the House Administration Committee, the Make Elections Great Again (MEGA) Act would ban ranked-choice voting and universal mail-in ballots in federal elections, prohibit states from accepting mailed ballots that arrive after Election Day, enable large-scale voter purges, and institute photo ID requirements.\nThe bill was endorsed by right-wing organizations including the Election Integrity Network, an organization that—in the words of the New York Times—\"has done more than any other group to take [President Donald Trump's] falsehoods about corruption in the democratic system and turn them into action.\" The Election Integrity Network has received funding from Citizens for Renewing America, a group founded by White House budget director and Project 2025 architect Russell Vought.\nTiffany Muller, president of the End Citizens United Action Fund, said in a statement Thursday that the MEGA Act \"is a dangerous anti-voter bill and the latest escalation of the same conspiracy-driven agenda that has nothing to do with protecting our elections and everything to do with clinging to power.\"\n\"There is not a shred of evidence of widespread voter fraud in the United States. Courts, audits, and election officials from both parties have repeatedly proved that,\" said Muller. \"Yet House Republicans, in their never-ending quest to stay in power, have once again chosen lies over facts to justify making it harder for eligible Americans to vote.\"\n“When you steal from the working class, impose policies that strictly benefit billionaire donors, and know voters are about to hold you accountable in the midterms, you try to change the rules of the game,\" Muller added. \"That’s the Republican playbook, and this bill is the proof. Make no mistake, this egregious power grab is about suppressing turnout, silencing voters, and ensuring minority rule.\"\nWhile the bill is unlikely to get through the Senate due to Democratic opposition, it represents an ominous look at the GOP's vision for election administration ahead of the pivotal November midterms.\nYunior Rivas of Democracy Docket noted Thursday that the legislation would go further than the SAVE Act, a bill House Republicans passed last year that one historian characterized as “the most extraordinary attack on voting rights in American history.” One advocate described the SAVE Act, which some Republicans are looking to revive, as a \"modern-day poll tax.\"\n\"Taken together, the MEGA Act is a catastrophic proposal for democracy in the United States,\" Rivas wrote. \"Voting would move from a fundamental right to a permission-based system—one where voters must repeatedly prove their eligibility, navigate bureaucratic obstacles, and hope they are not wrongly flagged by a single database.\"\nIn a statement, Sen. Alex Padilla (D-Calif.) warned that the MEGA Act shows Republicans are \"desperately trying to rig the rules for future elections because they know they cannot win on their unpopular agenda, which is raising costs for working families.\"\nRep. Joe Morelle (D-NY), the ranking member of the House Administration Committee, said the MEGA Act is further evidence that \"Trump and House Republicans are terrified of the American people.\"\n\"They are desperate to rig the system so they can choose their voters,\" said Morelle. \"This bill is their latest attempt to block millions of Americans from exercising their right to vote. I will fight this bill at every turn.\"\nThe MEGA Act was introduced amid growing fears that Trump is laying the groundwork to subvert the 2026 midterms. On Thursday, a group of Senate Democrats led by Padilla raised alarm over Justice Department efforts to seize sensitive data and purge voter rolls in states across the country.\n\"While most states are resisting this illegal voter roll grab, we are gravely concerned by the amount of sensitive data the department has already amassed on millions of American voters,\" the senators wrote. \"The department has failed to provide Congress, or the public, any information on how it is maintaining this vast amount of data, the guardrails in place to protect state voter information, how the data is to be used, or who in the federal government has access to this sensitive data.\"",
      "pubDate": "Fri, 30 Jan 2026 18:08:03 +0000",
      "source": "Common Dreams",
      "summary": "• The Republican chairman of the House committee that oversees federal elections introduced legislation on Thursday that one analyst characterized as possibly \"the most dangerous attack on voting rights...",
      "summarizedAt": "2026-01-30T19:48:10.402Z",
      "sensationalismScore": 58.32892805555556
    },
    {
      "title": "‘Wall Street Sweetheart’ Kevin Warsh Picked to Run Fed After Changing Views to Match Trump’s",
      "link": "https://www.commondreams.org/news/kevin-warsh-federal-reserve",
      "content": "Kevin Warsh, a former Federal Reserve governor, evidently \"passed the loyalty test\" put forward by President Donald Trump, said US Sen. Elizabeth Warren on Friday after Warsh was named the president's nominee to lead the central bank.\nTrump selected Warsh amid his longtime push for the Federal Reserve to aggressively cut interest rates as the labor market remains weak and inflation is persistently high.\nDuring his time at the Fed from 2006-11, Warsh was seen as a monetary policy hawk, opposing policies aimed at stimulating the economy.\nBut in recent weeks, as Trump has considered several potential successors to Federal Reserve Chair Jerome Powell, whose term is up in May, the president has indicated that Warsh has changed his views on lowering borrowing costs to match those of the White House.\n\"He thinks you have to lower interest rates,\" Trump said in December.\nWarsh called for “regime change in the conduct of policy\" at the central bank last year as the president was considering him as well as longtime economic adviser Kevin Hassett, Fed Gov. Christopher Waller, and BlackRock executive Rick Rieder.\n\n\n\n\nWith families across the US struggling to afford the rising cost of groceries, electricity, and other essentials, the progressive advocacy group Groundwork Collaborative emphasized that Trump selected a nominee \"with a record of siding with financiers over workers.\"\nWarsh played a key role in coordinating the Fed's response to the 2008 financial crisis, arranging the bailout of the insurance giant American International Group and brokering the sale of Bear Stearns to JPMorgan Chase.\n\"Warsh showed his true colors during the 2008 global financial crisis, helping bail out big banks while millions of families lost their jobs and homes,\" said Alex Jacquez, chief of policy and advocacy at Groundwork. “Kevin Warsh is a disastrous choice to oversee monetary policy.”\nNow that Warsh appears to have changed his views on interest rates to match Trump's, his nomination \"is the latest step in Trump’s plan to ensure the Fed does what he tells it to, not what’s best for American families,\" said Jacquez, a former Obama administration official.\n\"Trump chose Kevin Warsh for Fed chair because his father-in-law is a billionaire donor, the brains behind Trump’s idiotic scheme to invade Greenland. He also chose him because Warsh has shown willingness to wildly alter his views on monetary policy based on who is in the White House.\"\nThe nomination was announced weeks after Powell issued a stinging rebuke to Trump's Department of Justice following the news that the DOJ was threatening him with criminal charges over his testimony regarding renovations at the Federal Reserve building—charges that Powell said were a pretext for punishing him over his refusal to bend to Trump's demand for lowered interest rates.\nTrump has also tried to fire Lisa Cook, a member of the Fed's board of governors. The Supreme Court heard arguments this month in the case regarding the attempted dismissal, and appeared skeptical that it could legally move forward.\nThis week, the Fed opted to hold interest rates at 3.5-3.75%, above the 1% level Trump has called for.\nWarsh is currently a senior fellow at the conservative Hoover Institution at Stanford University and works with billionaire investor Stanley Druckenmiller.\nAfter the DOJ launched its criminal probe into Powell this month, Sen. Thom Tillis (R-NC) said he would not support any nominee to succeed the chairman until the DOJ's investigation was resolved.\nWarren (D-Mass.) said Friday that \"no Republican purporting to care about Fed independence should agree to move forward with this nomination until Trump drops his witch hunts\" that have targeted Powell and Cook.\n\n\n\n\nRep. Don Beyer (D-Va.) also pointed out that the selection of Warsh could be Trump's latest move in his push for US control of Greenland. Warsh is married to Jane Lauder, a daughter of longtime Trump friend and  Estée Lauder Companies heir Ronald Lauder, who first proposed that the vast, strategically located Arctic island should belong to the US instead of the kingdom of Denmark.\n\"Trump chose Kevin Warsh for Fed chair because his father-in-law is a billionaire donor, the brains behind Trump’s idiotic scheme to invade Greenland,\" Beyer said. \"He also chose him because Warsh has shown willingness to wildly alter his views on monetary policy based on who is in the White House.\"\n\"The Senate should note these bad qualifications and remember Warsh’s awful track record at the Fed during the 2008 financial crisis and Great Recession,\" the congressman added. \"These concerns along with Trump’s attacks on the Fed mean this nominee must face hard questions about independence and monetary policy. Warsh can’t just get a rubber stamp.\"",
      "pubDate": "Fri, 30 Jan 2026 17:28:09 +0000",
      "source": "Common Dreams",
      "summary": "• Kevin Warsh, a former Federal Reserve governor, evidently \"passed the loyalty test\" put forward by President Donald Trump, said US Sen. Elizabeth Warren on Friday after Warsh was named the president's...",
      "summarizedAt": "2026-01-30T19:48:12.546Z",
      "sensationalismScore": 57.66392805555556
    },
    {
      "title": "Washington Post Raid Is a Frightening Reminder: Turn Off Your Phone’s Biometrics Now",
      "link": "https://theintercept.com/2026/01/30/washington-post-hannah-natanson-fbi-biometrics-unlock-phone/",
      "content": "The search warrant to raid a Washington Post reporter’s home shows how authorities can open your phone without your consent.\nThe post Washington Post Raid Is a Frightening Reminder: Turn Off Your Phone’s Biometrics Now appeared first on The Intercept.",
      "pubDate": "Fri, 30 Jan 2026 16:13:06 +0000",
      "source": "The Intercept",
      "summary": "• The search warrant to raid a Washington Post reporter’s home shows how authorities can open your phone without your consent.\nThe post Washington Post Raid Is a Frightening Reminder: Turn Off Your Phon...",
      "summarizedAt": "2026-01-30T19:48:13.607Z",
      "sensationalismScore": 56.41309472222222
    },
    {
      "title": "Zohran Mamdani Wants NYC to Divest From Israel — But New Comptroller Pledges to Buy War Bonds",
      "link": "https://theintercept.com/2026/01/30/nyc-israel-bonds-mamdani-mark-levine/",
      "content": "A human rights group fanned the flames of conflict by threatening legal action if the city invested in war crimes.\nThe post Zohran Mamdani Wants NYC to Divest From Israel — But New Comptroller Pledges to Buy War Bonds appeared first on The Intercept.",
      "pubDate": "Fri, 30 Jan 2026 15:11:49 +0000",
      "source": "The Intercept",
      "summary": "• A human rights group fanned the flames of conflict by threatening legal action if the city invested in war crimes.\nThe post Zohran Mamdani Wants NYC to Divest From Israel — But New Comptroller Pledges...",
      "summarizedAt": "2026-01-30T19:48:14.673Z",
      "sensationalismScore": 55.39170583333333
    },
    {
      "title": "Trump Says He’s “Not at All” Deescalating in MN After Democrats Fold on Shutdown",
      "link": "https://truthout.org/articles/trump-says-hes-not-at-all-deescalating-in-mn-after-democrats-fold-on-shutdown/",
      "content": "The statement came hours after Trump celebrated a deal with Schumer to avoid a shutdown.",
      "pubDate": "Fri, 30 Jan 2026 19:47:01 +0000",
      "source": "Truthout",
      "summary": "• The statement came hours after Trump celebrated a deal with Schumer to avoid a shutdown....",
      "summarizedAt": "2026-01-30T19:48:02.857Z",
      "sensationalismScore": 49.97837277777778
    },
    {
      "title": "Iran’s Nationwide Internet Blackout Has Left Us Feeling Hopeless and Helpless",
      "link": "https://truthout.org/articles/irans-nationwide-internet-blackout-has-left-us-feeling-hopeless-and-helpless/",
      "content": "As Donald Trump threatens further military action, the sense of exhaustion in Iran is palpable.",
      "pubDate": "Fri, 30 Jan 2026 19:39:51 +0000",
      "source": "Truthout",
      "summary": "• As Donald Trump threatens further military action, the sense of exhaustion in Iran is palpable....",
      "summarizedAt": "2026-01-30T19:48:03.924Z",
      "sensationalismScore": 49.85892833333333
    },
    {
      "title": "Jeffries’s DHS Demand Is a Ban on Deporting Citizens — Which Is Already Illegal",
      "link": "https://truthout.org/articles/jeffriess-dhs-demand-is-a-ban-on-deporting-citizens-which-is-already-illegal/",
      "content": "DHS has detained and deported countless citizens — but has repeatedly denied doing so.",
      "pubDate": "Fri, 30 Jan 2026 19:16:07 +0000",
      "source": "Truthout",
      "summary": "• DHS has detained and deported countless citizens — but has repeatedly denied doing so....",
      "summarizedAt": "2026-01-30T19:48:04.993Z",
      "sensationalismScore": 49.4633725
    },
    {
      "title": "Venezuela’s Interim Government Agrees to Submit Monthly Budget to Trump Admin",
      "link": "https://truthout.org/video/venezuelas-interim-government-agrees-to-submit-monthly-budget-to-trump-admin/",
      "content": "Historian Greg Grandin discusses the latest developments as Trump also intensifies efforts to topple Cuba’s government.",
      "pubDate": "Fri, 30 Jan 2026 18:57:46 +0000",
      "source": "Truthout",
      "summary": "• Historian Greg Grandin discusses the latest developments as Trump also intensifies efforts to topple Cuba’s government....",
      "summarizedAt": "2026-01-30T19:48:06.062Z",
      "sensationalismScore": 49.157539166666666
    },
    {
      "title": "ICE Expected to Flood Ohio Next Week and Round Up Haitians Stripped of Legal Status By Trump",
      "link": "https://www.commondreams.org/news/ice-springfield-ohio-haitians-tps",
      "content": "The Trump administration is expected to flood Ohio with immigration agents next week to target thousands of Haitian migrants after they are stripped of their legal status. \nOne of the main targets will be the town of Springfield, where President Donald Trump and Vice President JD Vance infamously concocted the tale that Haitian immigrants were eating the pets of white residents to stoke xenophobia during the 2024 election, which unleashed an onslaught of racist threats and intimidation upon the community.\nEarlier this week, the Springfield News-Sun received a message sent to staff at the Springfield City School District saying that school officials were expecting a federal immigration enforcement operation to begin in the town sometime after February 3, when Haitian residents' temporary protected status (TPS) expires, and last at least 30 days.\nGiven that history and the escalating brutality with which US Immigration and Customs Enforcement (ICE) has carried out its recent surges in Minnesota and Maine, Holocaust historian Timothy Snyder said he was \"getting the impression that ICE is gearing up for a pogrom in Springfield, Ohio.\"\n\"Any day now, a swarm of armed state police dressed for war could descend\" on the town, wrote columnist Marilou Johanek in the Ohio Capital Journal. \"The small town of Springfield in Clark County is awaiting an invasion of unaccountable thugs who conceal their faces and identities, drive in unmarked vehicles with blackened windows, stomp on the Bill of Rights, and viciously brutalize human beings based on race and accent.\"\n\n\n\n \nThe 15,000 Haitians living in Springfield are among around 30,000 in Ohio and more than 500,000 across the US who are expected to lose TPS on Tuesday after it was abruptly revoked by the Department of Homeland Security (DHS) last year. The expiration could be halted by US District Court Judge Ana C. Reyes, who is expected to issue a decision on February 2.\nIf not, \"they could potentially be arrested, detained, or put in removal proceedings unless they have already applied for some other form of relief they have in addition to TPS, or that they are applying for in addition to TPS,” explained Emily Brown, Ohio State University Moritz College of Law’s Immigration Clinic Director to the Journal.\nWhile the Trump administration has often emphasized its supposed targeting of those in the US unlawfully, editor-in-chief David DeWitt at the Journal emphasizes that \"Haitians are currently in the United States legally,\" under TPS, which grants temporary legal status to those in danger from armed conflict, environmental disasters, or other extraordinary conditions in their home countries.\nThe Haitians living in the US are at risk of being deported back to what has been described as \"the most dangerous country in the world,\" in the midst of a gang war that killed over 8,100 people between January and November 2025, according to the United Nations.\n\"They are not here illegally,\" DeWitt wrote on social media. \"Trump is revoking their legal status on February 3, and then, according to reports, immediately sending ICE in to Springfield and Columbus, Ohio, to target them.\"\nAs part of a crusade to end migration from impoverished \"Third World\" countries, Trump has ramped up his use of racist invective against Haiti in recent months, proudly referring to it as a \"shithole country\" at a rally in December after denying having described it that way back in 2018.\nViles Dorsainvil, executive director of the Haitian Support Center in Springfield, told the Journal that rumors of the coming surge have struck terror into the hearts of many in the community.\n\"The folks are fearful,” Dorsainvil, who came to the United States from Haiti in 2020, said. “They came here just to work and send their kids to school and be here peacefully. All of a sudden, they find themselves in another scenario where they’re not accepted… They are panicked, and the worst thing is that they can’t even plan their lives for three months down the road.”\nOne TPS holder, 41-year-old Pushon Jacques, told the News-Sun that the potential loss of his status \"has a big impact.\" He said: “I won’t be able to work, I will not be able to provide for my family. It’s a bad situation to be in.”\nWhile the administration has emphasized \"self-deportation\" as a way to avoid being on the business end of an ICE jackboot, Jacques said: “The situation in Haiti—especially the political situation—has made Haiti unlivable... There is no place in Haiti that is safe right now.\"\n\n\n\n \nLocal reports say residents are already preparing for their town to come under siege, and despite the White House's portrayal of Haitians as loathed outsiders, many others in the community have come out to support them.\nChurches are running immersive role-playing sessions to train community members on what to do if ICE agents attempt to storm their doors, and residents have constructed phone chains to alert vulnerable community members when agents are spotted.\nThe Springfield City Council, meanwhile, has passed a resolution urging federal agents to comply with city policies that prohibit police from wearing masks and require them to carry identification, though the city has no authority to enforce them.\n“Springfield is a good place,” Jacques said. “I like the environment and the people, because Springfield has a lot of good people... I have never felt any racism, and I feel appreciated.”\nDespite attacks from the leaders of his party, Ohio Gov. Mike DeWine, a Republican, has defended his state's Haitian community, telling the statehouse bureau, \"I don't think it’s in our interest in this country for all the Haitians who are working, who are sometimes working two jobs, supporting their family, supporting the economy, I think it’s a mistake to tell these individuals you can no longer work and have to leave the country.\"\nAccording to a spokesperson for DeWine, there has been no formal communication between federal authorities and the governor about ICE's plans for the state. However, DeWine said, \"If ICE does in fact come in, comes in with a big operation, obviously we have to work this thing through and make sure people don't get hurt.\"\nThe ACLU of Ohio said it will be monitoring the situation in Springfield closely for unconstitutional actions.\n\"This despicable surge in lawless ICE officers descending upon Springfield will ignite swells of fear within the Haitian community, terrorize our Black and Brown neighbors, and cause considerable damage to citizens and non-citizens alike,\" said ACLU Ohio executive director J. Bennett Guess. \n\"Following the government’s senseless, brutal killings of Alex Pretti and Renee Nicole Good in Minneapolis, it is clear that ICE poses a grave threat to all who call Ohio home,\" he continued. \"The ACLU of Ohio urges state and local elected officials to do everything in their power to protect the 30,000 Haitians living in Central Ohio. We call on the US Congress to reject a DHS budget that allows these lawless agencies to continue putting our communities in danger.”",
      "pubDate": "Fri, 30 Jan 2026 18:25:49 +0000",
      "source": "Common Dreams",
      "summary": "• The Trump administration is expected to flood Ohio with immigration agents next week to target thousands of Haitian migrants after they are stripped of their legal status. \nOne of the main targets wil...",
      "summarizedAt": "2026-01-30T19:48:09.323Z",
      "sensationalismScore": 48.62503916666667
    },
    {
      "title": "'MAHA-Washing': Trump EPA Set to Reapprove Dicamba Despite Pesticide's Harms",
      "link": "https://www.commondreams.org/news/trump-dicamba",
      "content": "The US Environmental Protection Agency plans to reapprove dicamba despite the pesticide's proven health and environmental risks, the Washington Post reported Friday—a move that would seemingly fly in the face of the Trump administration's pledge to \"Make American Healthy Again.\"\nAccording to a draft statement obtained by the Post, the EPA called the reapproval “the most protective dicamba registration in agency history,\" while noting “several measures” to head off “ecological risks.”\nTwo EPA officials told the Post's Amudalat Ajasa on condition of anonymity that the agency would move to reapprove dicamba next week.\nIt would be the third time the EPA approved the pesticide. On both prior occasions, federal courts blocked the approvals, citing underestimation of the risk of chemical drift that could harm neighboring farms.\n“The fact that we’re here again after two failed attempts to fix this broken pesticide shows that Lee Zeldin and his army of industry lobbyists are utterly incapable of protecting the public,” Center for Biological Diversity (CBD) senior scientist Nathan Donley told the Post, referring to the EPA administrator.\nOne judge ruled in 2024 that since widespread dicamba drift damaged millions of acres of nontolerant crops, some farmers felt \"coerced\" to purchase expensive, dicamba-resistant seeds to safeguard their own fields, creating a \"near-monopoly\" for companies selling the products.\n\n\n\n\nSome scientific studies have linked dicamba to increased risk of cancer and hypothyroidism. The European Union classifies dicamba as a category II suspected endocrine disruptor.\nIn 2021, the Biden administration published an EPA report revealing that during Trump's first term, senior officials intentionally excluded scientific evidence of dicamba-related hazards, including the risk of widespread drift damage, before reapproving the dangerous chemical.\nA separate EPA report described the widespread harm to farmers and the environment caused by dicamba during the 2020 growing season.\nWriting for the New Lede this week, Donley warned that \"much like the greenwashing you see at the grocery store, with terms like 'eco-friendly' or 'green' advertising chemical-laden products on store shelves, Zeldin’s MAHA-washing paints the same rosy picture to distract from decisions that harm public health.\"\n\"We all stand to lose if this pesticide gets the green light,\" he added.",
      "pubDate": "Fri, 30 Jan 2026 17:58:06 +0000",
      "source": "Common Dreams",
      "summary": "• The US Environmental Protection Agency plans to reapprove dicamba despite the pesticide's proven health and environmental risks, the Washington Post reported Friday—a move that would seemingly fly in ...",
      "summarizedAt": "2026-01-30T19:48:11.483Z",
      "sensationalismScore": 48.16309472222222
    },
    {
      "title": "350,000 Haitians in U.S. \"at Risk of Losing Everything\" After Trump Revokes Legal TPS Status",
      "link": "http://www.democracynow.org/2026/1/30/temporary_protected_status_haiti",
      "content": "An estimated 350,000 Haitian immigrants are set to lose their temporary protected status, or TPS, on February 3, 2026, after President Trump signed an executive order to revoke their TPS shortly after coming into office. TPS holders live and work in the United States legally. During the 2024 presidential election, candidates Donald Trump and JD Vance spread racist invective about Haitian immigrants in Springfield, Illinois. Now ICE is reportedly planning to begin extensive raids on Haitian American communities like Springfield. “We are living under a cloud of terror,” says Guerline Jozef, the co-founder and executive director of Haitian Bridge Alliance. Her organization is mounting a legal challenge against the Trump administration’s revocation of TPS.\n“I’m anxious every day,” says Maryse Balthazar, a former journalist in Haiti who fled the country after its devastating 2010 earthquake. She now works as an elder care nurse in Florida. She worries about being separated from her U.S. citizen daughter, and for the safety of her son, also a TPS holder, if he were deported to Haiti, a country currently struggling with organized crime and political unrest. Balthazar says that if she were to lose her TPS, “it will be like another earthquake to me.”",
      "pubDate": "Fri, 30 Jan 2026 08:38:56 -0500",
      "source": "Democracy Now!",
      "summary": "• An estimated 350,000 Haitian immigrants are set to lose their temporary protected status, or TPS, on February 3, 2026, after President Trump signed an executive order to revoke their TPS shortly after...",
      "summarizedAt": "2026-01-30T19:48:16.793Z",
      "sensationalismScore": 43.843650277777776
    },
    {
      "title": "Ohio Train Derailment Victims Are Still Waiting for Justice",
      "link": "https://jacobin.com/2026/01/east-palestine-derailment-victim-compensation/",
      "content": "Three years after the toxic train derailment in East Palestine, Ohio, the railroad, lawyers, and myriad companies involved in a $600 million class action settlement have all been paid — while many residents have yet to receive anything.\nOhio EPA and EPA contractors collect soil and air samples from the derailment site on March 9, 2023, in East Palestine, Ohio. (Michael Swensen / Getty Images)\nOn a balmy evening last September, Michael Fowler stumbled out to the south rail line in East Palestine, Ohio, and sat down in the middle of the tracks. His dog, a white Chihuahua, was beside him. The sun was setting. He waited perilously for the next oncoming train.\nHe wouldn’t have to wait long. Dozens of times a day, freight trains blare through East Palestine, cleaving the small Ohio town in two. The stretch of tracks on which Fowler sat was just a few hundred yards west of the site where two and a half years earlier, a Norfolk Southern train carrying tank cars full of toxic chemicals derailed and burned. The accident sent dark plumes of smoke over the town, leached toxins into local creeks and soil, and ignited a national reckoning around rail safety, one that has since delivered few reforms.\nFowler, fifty-four, was upset with Norfolk Southern, an East Palestine police officer later reported in a sworn affidavit. He had not received the money he was promised from the $85 billion rail company — his cut of the $600 million settlement that Norfolk Southern had agreed to pay to resolve residents’ class action lawsuit over the derailment. Eighteen months after the settlement’s announcement, still no check had arrived.\nThat September night, Fowler had decided to take matters into his own hands. He hoped to “cost the railroad money,” the police officer wrote, by putting himself in the path of the trains, which ran so close to his home that he could see the tracks from his front lawn.\nFowler was not the only East Palestine resident waiting on restitution from the settlement, which was touted as “historic” by the deep-pocketed lawyers who negotiated it. Nearing the three-year anniversary of the derailment, the railroad, lawyers, and myriad companies involved in the settlement have all been paid — while many residents have yet to receive anything.\nThe settlement has been mired by delays and scandal. Many checks first promised in 2024 have yet to arrive. The class action lawyers, who have already collected their $180 million cut of the total, face allegations in court that they misled clients into accepting paltry sums. The private-equity-backed company responsible for doling out cash to residents has allegedly misallocated over $17 million and wrongly denied thousands of claims, all while carving out millions in fees from the settlement.\nAs a result, payouts have been delayed for months, leaving residents in the dark about when — or if — they will see any kind of justice for a disaster that upended their lives and whose long-term impacts on the town and their health remain unknown.\nAs the Trump administration axes regulations meant to prevent chemical and climate disasters, and companies like Norfolk Southern face reduced scrutiny for corporate negligence, civil cases like this take on an ever more central role in whatever process remains for accountability. But, at least in East Palestine, that system is leaving residents behind.\nAround 8 p.m. that night, an East Palestine police dispatcher placed an urgent call to Norfolk Southern. A caller had reported that a man was threatening suicide by train. All rail traffic through the town should be halted, the dispatcher said.\nOfficers soon found Fowler sitting on the railroad tracks in the fading light, very drunk. They escorted him off the rails, brought him to a hospital, and then charged him with criminal trespass. (The Lever could not reach Fowler, though an Ohio lawyer representing him said he was arranging a plea agreement with county prosecutors.)\nA few minutes later, Norfolk Southern’s freight trains resumed running, all through the night.\nA train passes through East Palestine in November, near “ground zero.” (Katya Schwenk)\n\n“Is It Safe to Live in Our House?”\nMany of the Norfolk Southern trains that pass through East Palestine carry petrochemicals, the noxious lifeblood of the plastics industry. The train that derailed on February 3, 2023, was carrying thousands of gallons of vinyl chloride, a dangerous chemical used in plastics manufacturing, from the Gulf Coast to a resin factory on the Delaware River.\nAn hour before the train derailed, a wheel bearing began to catch fire on car twenty-three. Surveillance cameras twenty miles east in Salem, Ohio, captured the first flames, unbeknownst to the crew. As the train reached the west side of East Palestine, the bearing failed entirely. Thirty-eight railcars careened from the tracks, erupting into flames.\nOn February 6, Norfolk Southern, contrary to expert advice it received, detonated holes in the five railcars that contained vinyl chloride, drained their contents into a ditch, and set the toxins on fire. A massive chemical plume filled the sky over East Palestine and surrounding towns for days, so vast and dark it looked like a thundercloud rolling in.\nThis course of action released over a million pounds of vinyl chloride and its byproducts into the town’s air and waterways, but it also had the convenient effect of quickly clearing the train tracks. Just two days later, on February 8, 2023, Norfolk Southern’s trains began running again through East Palestine.\nThe fires, the billowing chemical plume, the fine gray soot that covered homes in East Palestine, a north Appalachian town already in postindustrial decline — images of the derailment gripped the national consciousness. As the Lever helped expose, the story behind the derailment was inextricably linked to corporate greed: Norfolk Southern, enabled by a feckless Department of Transportation, had for years pushed to kill train safety rules that could have helped prevent such a catastrophe. It also, in the name of profits, operated ever longer and riskier trains — like the one that derailed in Ohio.\nIt was the kind of story that would play well in court.\nThe train cars were still burning when the first lawyers arrived in East Palestine. Soon, the town was crawling with class action attorneys, recruiting locals in droves to sue Norfolk Southern. Posters and flyers plastered about town advertising the various law firms promised justice alongside the grinning, floating heads of men in suits.\n“It was almost like they had those flyers printed out before they got here,” recalled Carly Tunno, an activist and mother who lives seven miles from the derailment site, just over the Pennsylvania border. “And we’re still figuring out, is it safe to live in our house?”\nBy mid-March, eighteen lawsuits had been filed on behalf of residents. The cases would ultimately be consolidated into a single class action suit. A judge appointed three lawyers, all from out of state, to preside over the litigation.\nThe attorneys had impressive resumes in complex cases: Jayne Conroy, a New York lawyer who has led litigation against Big Pharma over the opioid epidemic; Elizabeth Graham, who battled big-name auto manufacturers over faulty parts; and Seth Katz, part of the legal team that sued Columbia Gas over a massive natural gas explosion in Massachusetts in 2018.\nAll had made millions in the business of class actions and mass torts, both critical avenues for people to get justice for corporate wrongdoing. But the flourishing industry also has its own con men and speculators.\nNow they were turning to East Palestine.\nEast Palestine’s downtown in November. (Katya Schwenk)\n\n“Losing Everything”\nOn a Friday afternoon in May 2023, three months after the derailment, Will Schaffer was driving down Market Street in East Palestine when his Jeep spun off the road, crumpling against a telephone pole.\nA local cop who witnessed the accident assumed Schaffer was drunk. But when the officer got to the car, he realized Schaffer was having a seizure.\nSchaffer, 59, worked at a manufacturing plant in East Palestine, a half mile from what’s become known as “ground zero,” the site of the derailment. Despite the dayslong evacuation order, the machines at Schaffer’s employer had to keep running. So while the Norfolk Southern train still smoldered a few hundred yards away, the chemical plume wafting overhead, Schaffer remained at his post.\nThe symptoms soon began for Schaffer: headaches, strange rashes. (Some 60 percent of people in the vicinity of the derailment, in one survey, reported “persistent headaches,” alongside eye and nasal irritation.) The more serious warning signs came later: Mild brain fog, an occasional slip in his memory.\nNow, behind the wheel, he’d lost all control.\nSchaffer broke his back in two places. A concussion brought lingering cognitive issues. He’s been unable to work ever since, unable even to take the desk job offered by his former employer.\nWithout income, Schaffer lost his lot at a local mobile home park. To help with his care, his daughter quit her job as a cancer nurse. Now he spends his days in a small, spare apartment in Bessemer, Pennsylvania, waiting by the window for his five-year-old grandson, Knox, to get home from school.\n“We couldn’t get help with nothing,” said Michele Gasper, his ex-wife. “And this man, who had worked constantly, all his life, is sitting there, and he’s losing everything.”\nSchaffer had no history of epilepsy; his family blames the incident on the derailment. Seizures and other neurological issues have been documented as side effects of exposure to vinyl chloride and other chemicals known to have been present in the air after the crash. But data on the matter is limited, so it’s difficult to connect the accident to Schaffer’s condition with certainty — or assign blame.\nWill Schaffer and Michele Gasper. (Katya Schwenk)\nHelp seemed to arrive in April 2024. That month, the class action lawyers announced that Norfolk Southern had agreed to a $600 million settlement over the derailment. It was an unusually fast timeline for such a complex and high-profile case; the settlement was reached just over a year after the first lawsuits were filed.\nThe attorneys justified the quick turnaround by saying many residents in East Palestine could not afford to wait for a check. “The relief that the community needed was immediate,” Graham, one of the three lead lawyers on the case, later said. For the Schaffers and many other residents, there was truth to this.\nBut a prompt settlement also meant the lawyers got paid more quickly. Attorneys in these cases typically get their paycheck when the deal is signed, before the settlement is allocated. That creates an incentive for quick deals, but it also reduces lawyers’ investment in making sure everyone else gets their due.\nAll people living and working within 20 miles of the derailment site — an area that encompasses not just East Palestine but several of the surrounding towns in Ohio and Pennsylvania — were eligible to submit claims. Awards, based on residents’ proximity to ground zero, would range from a few hundred dollars to tens of thousands. All told, the $600 million, minus the attorneys’ $180 million cut, could be divided among a class of hundreds of thousands of people.\nFor those within 10 miles of the derailment, however, there was another pot of money, some $129 million. The class action attorneys called it the “personal injury program,” and, in pamphlets they distributed around town, promised an additional $25,000 per person for East Palestine residents who submitted claims.\nTo receive this additional money, there was a catch. Residents had to sign a release form waiving their right to sue Norfolk Southern for any future “personal injury” — that is, any health issues, including cancer or other serious illness, that arose in the future related to the derailment.\nSchaffer’s family filled out the paperwork, glossing over the fine print. The payments meant that Schaffer could “get back on his feet,” his daughter, Vinci Schaffer, said. And they had no money for a lawyer. By May 2025, a letter had arrived in the mail confirming that Schaffer was eligible for a $25,897 payout, scheduled to arrive imminently.\nWeeks went by, and then months. No check arrived. Although Vinci and her boyfriend lived within 20 miles of the derailment, making them eligible for a cut of the settlement, their own claims were denied.\nThe family says the payout confirmation letter remains the only communication they have ever received from the attorneys.\n“We don’t even know who they are,” said Vinci.\nThe site of the derailment, almost three years on. (Katya Schwenk)\n\n“We Were Gullible”\nIn the first days after the derailment, Beth Kosar Vivo, a mother in nearby Boardman, Ohio, got a job with Perfected Claims, a legal company that swiftly set up shop in East Palestine. At first, the operation was staged in the basement of an abandoned building on Main Street, a former inn with boarded-up windows, not far from the burning train.\nPerfected Claims is not a law firm, as the company’s fine print makes clear. The company is just one player among the peripheral cottage industries that have cropped up around valuable, complex cases like the lawsuit against Norfolk Southern. The operation consults with law firms preparing to sue in the wake of disaster, helping them prospect for clients.\nIt dispatched representatives to Maui after the devastating fires in 2023 and to farmlands in Maine poisoned by forever chemicals. In East Palestine, working with one of the many law firms jostling for a role in the settlement, Perfected Claims hired Kosar Vivo as a community liaison. She became a point of contact for residents with questions about the deal.\nOn Kosar Vivo’s first day of work, Perfected Claims called in Erin Brockovich, the environmental advocate who inspired the eponymous film about a rural California town suing over groundwater poisoning. Brockovich, who now works as a kind of celebrity consultant for law firms, roamed town in aviators and a leather moto jacket, encouraging residents to join the litigation. At the time, the sight helped assure Kosar Vivo that her work for Perfected Claims was important and just.\nAfter the settlement announcement, Kosar Vivo’s work intensified. She realized her employer was particularly concerned about the low number of people signing up for the personal injury payout — the $129 million set aside for residents like Schaffer, who were willing to sign away future claims against Norfolk Southern.\n“We would get emails like, ‘Get these people to sign up for it,’” Kosar Vivo told me. “Not too many were.”\nPerfected Claims referred questions about their work on the case to the law firm they partnered with in East Palestine, which did not respond to the Lever’s queries.\nA home in East Palestine just across the railroad tracks. (Katya Schwenk)\nThe lawyers had reason to be concerned. A clause in the settlement agreement ensured that if not enough people signed away their rights to sue Norfolk Southern down the line, the entire deal would collapse. It was a tactic by Norfolk Southern to “insulate itself from more lawsuits,” as attorneys wrote in one filing — like the tens of thousands of lawsuits Johnson & Johnson faced over its talc-based baby powder, which plaintiffs alleged caused cancer.\nThough not uncommon, such a structure creates “a very heavy incentive for class counsel to strong-arm class members into accepting a settlement agreement,” explained Elizabeth Chamblee Burch, a University of Georgia School of Law professor focused on class actions and complex litigation. “Because if the defendant walks away, then nobody gets paid anything — including class counsel.”\nThe Lever contacted all three lead attorneys on the case multiple times; none responded to a list of detailed questions about their work on the deal.\nIn a statement to the Lever, Norfolk Southern noted that the “administration, investment and distribution of the Settlement Fund is the sole responsibility of the Settlement Administrator and Class Counsel,” adding that the rail company “has fully complied with all its obligations under the Settlement, including the timely contribution of all required payments to the Settlement Fund to date.”\nFor East Palestine residents, whether or not to opt in to the personal injury payout was an agonizing decision. If they — or their children — developed serious health conditions down the line as a result of the chemical exposure, were they willing to give up their right to compensation?\n“I thought, this is ridiculous,” recalled Marie Gordon-Coontz, an East Palestine resident who lives about a mile and a half from the derailment site, and who was a plaintiff in one of the first cases against Norfolk Southern. “I’m not signing away my rights.” She certainly wouldn’t do so for her daughter, who at the time was only six.\nBy the summer of 2024, the class action attorneys were increasingly concerned that the settlement could fall through because so many residents weren’t submitting personal injury claims. “The low take rate on [personal injury] is putting the settlement in jeopardy,” one of the lead attorneys wrote in a July email later revealed in court documents.\nTo encourage more residents to sign up, the lawyers launched a public relations blitz, even hiring their own communications firm. Though the attorneys originally told the court they anticipated the average claims payout to be $10,000, they raised the estimate to $25,000 at the end of July, promising residents in pamphlets circulated around town that “a greater per person Personal Injury Payment will be available.”\nThe lawyers reiterated the $25,000 figure at a virtual town hall meeting that August. They then introduced a video of Arch Carson, an associate professor at the University of Texas School of Public Health, whom they called an “experienced doctor.” Carson informed residents watching the meeting that “based on my best judgment, there will not be any long-term health impact of the chemical exposure from the derailment to community members of East Palestine.”\nHe added, “I would personally not expect one person to develop a cancer as a result of this exposure.”\nSoon claims began to soar. From the last week of July 2024 onward, the number of claims submitted for personal injury rose by over 300 percent.\nThis was a mistake, said Kosar Vivo. Looking back, she says she was wrong to believe her employer, to encourage people to agree to the settlement.\n“We were gullible,” she said.\nEast Palestine residents at a November meeting about the class action lawsuit. (Katya Schwenk)\n\n“This Is War”\n“There ain’t enough money.” Mindy Bish paused, letting the words sink in. Then she said it again, more slowly: “There ain’t enough money. What they promised to you when you signed was a lie, and there ain’t enough money.”\nBish, a trial lawyer, stood in the low-ceilinged basement of a Best Western in Columbiana, Ohio, a few miles outside of East Palestine. She was flanked by a small band of attorneys. Before her sat a hundred or so people, residents of East Palestine and surrounding towns.\nBish, sixty-five, is a partner at an Atlanta firm that has pioneered an aggressive approach to plaintiffs’ litigation. She arrived in East Palestine in December 2024, long after the ink had dried on the settlement deal, and started talking to residents.\n“What they started to talk about was this class action settlement, and how much money it entitled them to,” Bish told me. “And some of them were very sick. And I thought, how? How does this happen?”\nBish has since intervened in the case on behalf of residents who want to be released from the settlement. In what she admits is a “long shot,” she’s accusing the class action lawyers of “fraud and misrepresentation,” of concealing “critical expert findings about health risks to the Court and to the class claimants,” and “inducing class members to sign personal injury releases in exchange for inadequate personal injury payments.”\nThe promised $25,000 payments were wildly low, Bish and her team alleged in court records, particularly given that some residents had doctors prepared to testify that they were suffering serious health consequences from exposure.\nBish also represents hundreds of plaintiffs — clients who were not part of the original class action — in a new and unconventional lawsuit against Norfolk Southern and a long list of additional defendants, including the massive investment firms BlackRock and Vanguard, a railroad trade association, and even the local school district, for complicity in the derailment.\nFor many residents who felt equally betrayed by Norfolk Southern, local authorities, and the class action lawyers, Bish has become a new source of hope. “She’s honest,” a man beside me at the meeting remarked as she spoke.\nTonight that honesty was painful. Because so many residents ultimately submitted personal injury claims, Bish explained that it was essentially impossible for everyone to receive even the $25,000 they’d been promised from the fixed pool of money.\nMindy Bish speaking. (Katya Schwenk)\nTo claw that money back, Bish told the room, she was going after the class action lawyers.\n“They’re running like rats trying to abandon the ship,” she said.\nBish remained long after the meeting, holding court in a folding chair for a line of residents eager to consult with her. “This is war,” she told me the next morning, over breakfast in the hotel lobby. “This is really war. And you have to provide.”\nMotivated by what she’s seen in East Palestine, she’s delayed her planned retirement. Now she’s replicating her strategy in other communities beset by disasters, like Conyers, Georgia, where a chemical plant fire engulfed the town ina cloud of chlorine gas, and Roseland, Louisiana, where oily black rain fell on homes after a lubricant facility exploded.\nBut would she be any different from the lawyers that came before her, who had collected their own windfall and left town?\n“What she’s filling is a very real void,” Alexandra Lahav, a law professor at Cornell University, told me when I asked her about Bish’s up-close-and-personal approach. A “black hole of communication” is a “real problem” in class action suits, Lahav said. “But is she leading them down the primrose path?” Lahav mused. “That’s the question. And I don’t know the answer to that.”\nIn this part of the country, people are used to real help never arriving.\nOne resident I spoke to, who was diagnosed with cancer in 2024, recalled the checks that his father and uncle received in the mail, every so often, as compensation for the asbestos exposure they experienced working in Ohio steel mills. (The resident asked to remain anonymous to not jeopardize future legal action he might take against Norfolk Southern.)\n“My whole life, we got mailbox money,” he told me. “But it was never anything you could take to the bank.”\nA rail crossing in East Palestine. (Katya Schwenk)\n\n“Staggering” Errors\nThe full extent of the mishandling of the class action settlement became clear last spring. In May 2025, an audit uncovered “significant and pervasive” problems with Kroll Settlement Administration, the private company charged with disbursing checks to residents.\nAccording to investigators, Kroll hadn’t just been slow to process claims and cut checks — its process was riddled with errors. The company had allegedly denied hundreds of claims incorrectly and routinely miscalculated payouts. Subsequent court documents revealed that the company was outsourcing its claim review process to workers in India.\nIn total, it had allegedly overpaid claims by upward of $17 million, a “staggeringly high” error rate, the class action lawyers wrote in a court pleading, and one that left far too little left to properly compensate everyone.\nAll the while, Kroll was siphoning cash from the settlement fund to pay for its work.\n“While Class Members have grown increasingly frustrated, Kroll has pocketed over $9.5 million from the Settlement Fund for its own fees,” attorneys wrote in an October court filing. (Kroll, in a December 22 agreement with class action attorneys, agreed to pay $17 million back to the settlement fund, a figure that would cover most of the alleged overpayments but not the millions in fees it charged to the settlement.)\nKroll did not respond to multiple inquiries from the Lever about its work on the East Palestine settlement.\nKroll is a major player in the niche but lucrative business of settlement administration. It’s also backed by private equity, an industry known for aggressively slashing costs and milking profits from its acquisitions. In 2018, Kroll was acquired by Duff & Phelps, an investment firm; two years later, Duff & Phelps was acquired by several global investors, including the private equity firm Stone Point Capital.\nSince the acquisition, concerns have emerged about Kroll’s involvement in other settlements. In its work distributing settlement checks related to a 2018 lawsuit over a university’s false advertising practices, the company allegedly made $16.5 million in incorrect payments before being pulled off the case, causing delays and confusion.\nThe story was the same in East Palestine, where nearly everyone I spoke to was still waiting on a check, frustrated by the litany of systems that had failed them.\n“It’s not about the money,” people said — but when money was all the restitution had been promised, it was inevitably about the money.\n“I’ll donate it to charity, but I want it because of what they did,” said Ben Terwilliger, fifty-four, whose home lies just a few hundred feet from the derailment site.\n“They thought, ‘They’re hillbillies, throw them a couple bucks and be done with it,’” he added.\n\n“Catastrophic Failure”\nIn the first days after the derailment, chemicals glistened like “vegetable oil” on the surface of Sulphur Run, a small creek that runs along the railroad in East Palestine, flowing into the Ohio River, a tributary of the Mississippi. Since then, Norfolk Southern has aerated the creek and dredged out the soil as part of its remediation efforts.\nBut on a cold morning this past November, traces of a rainbow sheen shimmered on the surface of the murky creek as a freight train roared by. Was it typical industrial muck? Or remnants from the derailment?\nTo find out, scientists from Three Rivers Waterkeeper, a Pittsburgh-based environmental group,  were wading through the water alongside a local creek ranger, taking photographs and collecting soil samples. They’ve been testing the water for two years, trying to answer the question that residents have been asking since the train first went off the tracks: Are they safe?\nScientists with Three Rivers Waterkeeper, alongside a local creek ranger, test soil in Sulphur Run in East Palestine. (Katya Schwenk)\nFive days after the derailment, state and federal officials declared that East Palestine residents could “return safely home” — a conclusion for which there was “not a strong scientific basis,” as one epidemiologist put it, given the many unknowns about the accident. Still, the claim was repeated by Norfolk Southern, local authorities, and the Biden administration.\nThe vacillating, disorganized response to the derailment by both the Environmental Protection Agency (EPA) and local officials has been roundly criticized. Andrew Whelton, a professor of civil, environmental, and ecological engineering at Purdue University, described it to me as a “catastrophic failure of science, engineering, and practice.”\nAs part of the court battle, the class action lawyers in East Palestine brought in their own experts to evaluate the health impacts of the derailment. Their experts, too, tested the town’s air and soil. But the results of those tests — and the experts’ conclusions about the dangers for East Palestine residents — are sealed in court documents.\nThe August 2024 video of Carson, the University of Texas professor dismissive of long-term health concerns, remains one of the few pieces of testimony the lawyers have shared with residents.\nCarson, a medical toxicologist, told me that he was unaware of the controversy his video had caused. “All I did was look at the documentary evidence that was available to me,” he said. After surveying EPA testing, among other materials, he concluded that the chemical exposure experienced by residents was negligible. He said he was not paid for his work on the case and that he regularly provides expert testimony for both plaintiffs and defendants in similar litigation.\nStill, Carson said he was under no illusions about the potential issues with the litigation. “Soon after the accident, hundreds of attorneys swooped in, promising all kinds of huge settlement deals for the community,” he said. “My assumption, when I was making the recording, was that [the class action attorneys] were attempting to calm the fervor and back out of some of the promises they had made.”\nFaced with claims from Bish and some residents that Carson’s video amounted to fraud, one of the class action lawyers told a judge in September 2024 that “we have never proffered any information to suggest that there is zero risk to this community.” (She noted that the professor was a “friend of one of the attorneys” and that the video, created by a public relations company the class action attorneys hired, “was meant as nothing more than an attempt to quell some of the fearmongering.”)\nThis matter, however, is far from settled. Timothy Ciesielski, a research scientist at Case Western Reserve University’s Swetland Center for Environmental Health, who is part of a consortium of researchers from universities across the country studying the impact of the derailment in East Palestine, said he disagreed with Carson’s assertion that there would be “not be any long-term health impact” to residents.\nWithin the scientific working group he belongs to, he said, there was “a noncontroversial, universal consensus that we would not know that. That you could not say that,” Ciesielski said.\nRather, he said, the full scope of the environmental impact of derailment remains unknown.\nCiesielski recalled the early days of his work in the town, where he spoke with residents desperate to know more about the risks. “We were talking to people that needed to decide, ‘Do I get out of here? Do I leave my home?’” he said of his time in East Palestine. “And we really could not tell them.”\nScientists with Three Rivers Waterkeeper collect soil samples for testing. (Katya Schwenk)\nThis is a central conundrum in environmental disaster cases: How can you judge what fair compensation might look like when the long-term health impacts are so difficult to divine?\n“In these kinds of cases where you have toxins involved, sometimes it’s years before you know,” said Alexandra Lahav, the Cornell law professor. For example, the public health consequences of the 2010 Deepwater Horizon oil spill are an ongoing subject of research, while struggling Gulf Coast residents say they were cheated out of fair compensation in the subsequent legal fight.\nIf there is any winner from the class action settlement in East Palestine, it’s Norfolk Southern, which is now largely off the hook if future costs emerge.\nThe railroad’s defense lawyers, from the major law firm WilmerHale, were lauded for their performance in the litigation. Norfolk Southern’s insurance policy — which covered more than $1 billion in liability for the disaster — essentially zeroed out the cost of the settlement. (The railroad says it has paid $2 billion in total over the derailment, when you include other lawsuits and remediation efforts.) In the meantime, the railroad has been pursuing an $85 billion megamerger to expand its reach across the country.\nMeanwhile, the company’s trains are still running, some forty-six times a day, through East Palestine, as residents wait for their checks to arrive. That includes Fowler, now ensnared in a legal quagmire after putting himself in the path of the trains, and Schaffer, whose life went off the rails three years ago — and has never really gotten back on track.\n“After he pays his bills, he has like $50, you know,” said Vinci, Schaffer’s daughter.\n“And what if he wants to go buy a scratch-off ticket?” she adds. “Because he might be more lucky with that than he was with the derailment.”\n\nThis article was first published by the Lever, an award-winning independent investigative newsroom.",
      "pubDate": "2026-01-30T13:30:55.000Z",
      "source": "Jacobin",
      "summary": "• Three years after the toxic train derailment in East Palestine, Ohio, the railroad, lawyers, and myriad companies involved in a $600 million class action settlement have all been paid — while many res...",
      "summarizedAt": "2026-01-30T19:48:17.858Z",
      "sensationalismScore": 43.71003916666667
    }
  ]
}