{
  "lastUpdated": "2026-01-30T20:15:41.984Z",
  "headline": {
    "title": "Students Walk Out Across the Country to Protest ICE",
    "link": "https://www.motherjones.com/politics/2026/01/students-ice-protest-immigration/",
    "content": "Students at the University of Minnesota, united with hundreds of groups across the country, are imploring people, young and old, to join a general strike on Friday. No school, no work, no economic participation, all toward the goal of ceasing funding for Immigration and Customs Enforcement.  The strike comes after weeks of the Department of […]",
    "pubDate": "Fri, 30 Jan 2026 19:10:22 +0000",
    "source": "Mother Jones",
    "summary": "• Students at the University of Minnesota, united with hundreds of groups across the country, are imploring people, young and old, to join a general strike on Friday. No school, no work, no economic par...",
    "summarizedAt": "2026-01-30T20:15:28.195Z",
    "isPaywalled": false,
    "sensationalismScore": 68.91111555555555
  },
  "articles": [
    {
      "title": "Students Walk Out Across the Country to Protest ICE",
      "link": "https://www.motherjones.com/politics/2026/01/students-ice-protest-immigration/",
      "content": "Students at the University of Minnesota, united with hundreds of groups across the country, are imploring people, young and old, to join a general strike on Friday. No school, no work, no economic participation, all toward the goal of ceasing funding for Immigration and Customs Enforcement.  The strike comes after weeks of the Department of […]",
      "pubDate": "Fri, 30 Jan 2026 19:10:22 +0000",
      "source": "Mother Jones",
      "summary": "• Students at the University of Minnesota, united with hundreds of groups across the country, are imploring people, young and old, to join a general strike on Friday. No school, no work, no economic par...",
      "summarizedAt": "2026-01-30T20:15:28.195Z",
      "isPaywalled": false,
      "sensationalismScore": 68.91111555555555
    },
    {
      "title": "RFK’s Overhauled Autism Committee Is Even Worse Than It Looks",
      "link": "https://www.motherjones.com/politics/2026/01/rfks-overhauled-interagency-autism-coordinating-committee-is-even-worse-than-it-looks/",
      "content": "Last April, Health and Human Services Secretary Robert F. Kennedy, Jr. promised that his agency would find the cause of autism “by September.” That didn’t pan out, but this week he appears to be trying again—by stacking a decades-old committee devoted to “innovations in autism research, diagnosis, treatment, and prevention” with his friends and fellow […]",
      "pubDate": "Fri, 30 Jan 2026 19:56:51 +0000",
      "source": "Mother Jones",
      "summary": "• Last April, Health and Human Services Secretary Robert F. Kennedy, Jr. promised that his agency would find the cause of autism “by September.” That didn’t pan out, but this week he appears to be tryin...",
      "summarizedAt": "2026-01-30T20:15:21.866Z",
      "isPaywalled": false,
      "sensationalismScore": 59.68583777777778
    },
    {
      "title": "Trump’s Minions Are Pressuring Prosecutors to Charge ICE Protesters Based on Scant Evidence",
      "link": "https://www.motherjones.com/politics/2026/01/trump-us-attorneys-office-minnesota-prosecutors-resignations-ice-protesters-evidence-don-lemon/",
      "content": "More federal prosecutors in Minnesota have resigned or are preparing to do so, in part because the Trump administration has asked them to file criminal charges against anti-ICE protesters without appropriate evidence, according to multiple people with knowledge of the situation. The prosecutors, at the US Attorney’s Office in Minnesota, have been deluged with allegations […]",
      "pubDate": "Fri, 30 Jan 2026 19:43:20 +0000",
      "source": "Mother Jones",
      "summary": "• More federal prosecutors in Minnesota have resigned or are preparing to do so, in part because the Trump administration has asked them to file criminal charges against anti-ICE protesters without appr...",
      "summarizedAt": "2026-01-30T20:15:24.658Z",
      "isPaywalled": false,
      "sensationalismScore": 59.46056
    },
    {
      "title": "The Church at the Center of Don Lemon’s Arrest Has Ties to Christian Nationalism",
      "link": "https://www.motherjones.com/politics/2026/01/the-church-at-the-center-of-don-lemons-arrest-has-ties-to-christian-nationalism/",
      "content": "On Friday, former CNN anchor Don Lemon was arrested in Los Angeles for covering a protest that disrupted services at Cities Church in Minneapolis on January 18. The arrest drew widespread attention because of its infringement on Lemon’s First Amendment rights; journalism groups, including the National Association of Black Journalists, condemned it. What got lost […]",
      "pubDate": "Fri, 30 Jan 2026 19:31:42 +0000",
      "source": "Mother Jones",
      "summary": "• On Friday, former CNN anchor Don Lemon was arrested in Los Angeles for covering a protest that disrupted services at Cities Church in Minneapolis on January 18. The arrest drew widespread attention be...",
      "summarizedAt": "2026-01-30T20:15:26.426Z",
      "isPaywalled": false,
      "sensationalismScore": 59.26667111111111
    },
    {
      "title": "House Progressives Unveil 'Defund the Oligarchs, Fund the People' Resolution",
      "link": "https://www.commondreams.org/news/trump-oligarchs",
      "content": "As President Donald Trump continues to serve billionaires over working people and degrade the US economy, a trio of progressive congresswomen on Friday introduced the Defund the Oligarchs, Fund the People Resolution.\n\"Trump promised to lower costs for families on day one, but a year since he took office, grocery, housing, and healthcare costs are out of control,\" said Rep. Rashida Tlaib (D-Mich.), who is leading the measure with Congresswomen Pramila Jayapal (D-Wash.) and Delia Ramirez (D-Ill.). Rep. Summer Lee (D-Pa.) is an original co-sponsor.\nTlaib took aim at Trump and Republicans who control both chambers of Congress for forcing through their so-called One Big Beautiful Bill Act last year: \"He signed into law the largest cuts to healthcare and food assistance in the history of our country, all to give trillions of dollars in tax breaks to his rich donors and their massive corporations.\"\n\"Meanwhile, 60% of Americans are living paycheck to paycheck, and CEOs are making 281 times more than their average worker,\" she stressed. \"It's time to tax the rich, defund the oligarchy, and invest those funds in the needs of working families.\"\n\"Every dollar that gets plundered by billionaires through tax breaks, corporate giveaways, and political favoritism is a dollar that is taken away from healthcare, housing, education, and good jobs.\"\nThe resolution declares that \"the United States was created to be a democracy, founded on the principle that all people are created equal, governed not by kings or corporate masters but by themselves as free citizens,\" and \"the gravest threat to democracy and individual freedoms is the alliance of private wealth and authoritarian government.\"\nAt various moments over the past 250 years, Americans have \"sounded the alarm\" over oligarchy and the federal government \"has vigorously combated excessive concentrations of power and wealth,\" the measure notes. However, in recent decades, the government \"has forfeited its role safeguarding democracy.\"\nThe resolution highlights that the combined wealth of the country's 900 billionaires exceeds that of the 67,000,000 households in the poorest 50%, as working people contend with stagnant wages and struggle to afford everything from healthcare to housing. Trump notably said during a Thursday Cabinet meeting that \"I don't want to drive housing prices down, I want to drive housing prices up for people that own their homes. And they can be assured that's what's going to happen.\"\n\n\n\n\nWhile many measures introduced by progressives don't even receive votes in the GOP-controlled Congress, this one is especially unlikely to go anywhere, given that it explicitly calls out not only the superrich donors who use their money to control the US political system but also the president, whom many lawmakers in his party are afraid to criticize.\nBlasting \"the quid pro quo\" between Trump and the ultrawealthy oligarchs and corporations, the resolution emphasizes that they \"are corrupting United States politics through billions in open and hidden campaign contributions and by exploiting their monopoly control in key sectors of the economy, and especially over media, information, and emerging digital technologies.\" \n\"Trump has permitted pay-to-play schemes to become endemic, as oligarchs leverage political contributions to win hundreds of billions in taxpayer-funded federal subsidies, tax breaks, regulatory rollbacks, and government contracts despite exploiting workers and polluting communities,\" it continues, specifically pointing to spending by the fossil fuel, tech, and cryptocurrency industries.\n\"Public funds belong to the people of the United States and should be invested in education, healthcare, housing, clean energy, and infrastructure, not used to enrich the wealthiest individuals and most powerful corporations,\" the resolution argues. It also expresses concern about a decline in union membership that \"has diminished the ability of the labor movement\" to continue its \"significant historical role in counteracting corporate power, reducing inequality, and ensuring the political system is responsive to the interests of ordinary Americans, not just wealthy elites.\"\nThe resolution includes various demands for the president and Congress. It says that Trump \"must not reward oligarchs and billionaire-controlled corporations with lucrative, publicly funded contracts, loans, and grants\" when they engage in corrupt scheming, fail to fairly compete in open markets, and break federal laws.\nIt also says that the president and Congress must: \n\nAct with all deliberate speed to protect election integrity;\nBreak up all concentrations of economic and political power;\nDrastically reduce levels of economic inequality and concentrations of inherited wealth;\nReform the Supreme Court;\nSupport the dramatic expansion of unions;\nExplore ways to promote alternative, noncorporate forms of ownership; and\nUse public money to fund programs that raise the standard of living.\n\n\"While working families have to choose between paying rent, buying groceries, or keeping the heat on, billionaires are just getting richer,\" said Jayapal. \"We must rein in corporate power by breaking up monopolies and reforming campaign finance laws.\" \n\"It's time to make billionaires pay their fair share of taxes and reinvest those funds to provide for our communities—housing, healthcare, and education,\" she continued. \"Our resolution calls for a political and economic system that benefits working families, not one that enriches the ultrawealthy.\"\nThe resolution comes just months before the midterm elections and amid pressure on Democrats to prove they can offer a true alternative to Trump's government full of loyalists, weak labor market, persistently high inflation, and tax giveaways to the rich—including Elon Musk, a former presidential adviser and the richest person on the planet. \nSome of that pressure has come from the grassroots group Our Revolution, which is backing the resolution alongside organizations including Americans for Tax Fairness, Climate and Community Institute, MoveOn, National Nurses United, Patriotic Millionaires, People's Action, Public Citizen, RootsAction, and Social Security Works.\n\"Every dollar that gets plundered by billionaires through tax breaks, corporate giveaways, and political favoritism is a dollar that is taken away from healthcare, housing, education, and good jobs. That is not just corruption, it is a betrayal of who government is supposed to serve, and it is why so many people feel that democracy is not working for them,\" said Our Revolution executive director Joseph Geevarghese.\n\"The truth is, none of the policies working families are fighting for can ever fully materialize as long as corporate money and billionaire influence are writing the rules,\" he added. \"Lawmakers cannot keep pretending to serve both the corporate class and working families at the same time. If we want real progress on wages, healthcare, housing, and climate, cutting off corporate corruption and reinvesting in our communities has to be part of how we govern, not just something we talk about during elections.\"",
      "pubDate": "Fri, 30 Jan 2026 18:47:32 +0000",
      "source": "Common Dreams",
      "summary": "• As President Donald Trump continues to serve billionaires over working people and degrade the US economy, a trio of progressive congresswomen on Friday introduced the Defund the Oligarchs, Fund the Pe...",
      "summarizedAt": "2026-01-30T20:15:29.953Z",
      "isPaywalled": true,
      "sensationalismScore": 58.53056
    },
    {
      "title": "Federal Authorities Arrest Don Lemon Over Filming of Church Protest",
      "link": "https://truthout.org/articles/federal-authorities-arrest-don-lemon-over-filming-of-church-protest/",
      "content": "Lemon's lawyer called his arrest an “attack” on press freedom and a distraction from “crises” the administration faces.",
      "pubDate": "Fri, 30 Jan 2026 18:35:38 +0000",
      "source": "Truthout",
      "summary": "• Lemon's lawyer called his arrest an “attack” on press freedom and a distraction from “crises” the administration faces....",
      "summarizedAt": "2026-01-30T20:15:31.800Z",
      "isPaywalled": false,
      "sensationalismScore": 58.332226666666664
    },
    {
      "title": "‘Most Dangerous Attack on Voting Rights Ever’? New GOP Election Bill Sparks Dire Warnings",
      "link": "https://www.commondreams.org/news/republican-voting-rights",
      "content": "The Republican chairman of the House committee that oversees federal elections introduced legislation on Thursday that one analyst characterized as possibly \"the most dangerous attack on voting rights ever\" put forth in the US Congress.\nLed by Rep. Bryan Steil (R-Wis.), chair of the House Administration Committee, the Make Elections Great Again (MEGA) Act would ban ranked-choice voting and universal mail-in ballots in federal elections, prohibit states from accepting mailed ballots that arrive after Election Day, enable large-scale voter purges, and institute photo ID requirements.\nThe bill was endorsed by right-wing organizations including the Election Integrity Network, an organization that—in the words of the New York Times—\"has done more than any other group to take [President Donald Trump's] falsehoods about corruption in the democratic system and turn them into action.\" The Election Integrity Network has received funding from Citizens for Renewing America, a group founded by White House budget director and Project 2025 architect Russell Vought.\nTiffany Muller, president of the End Citizens United Action Fund, said in a statement Thursday that the MEGA Act \"is a dangerous anti-voter bill and the latest escalation of the same conspiracy-driven agenda that has nothing to do with protecting our elections and everything to do with clinging to power.\"\n\"There is not a shred of evidence of widespread voter fraud in the United States. Courts, audits, and election officials from both parties have repeatedly proved that,\" said Muller. \"Yet House Republicans, in their never-ending quest to stay in power, have once again chosen lies over facts to justify making it harder for eligible Americans to vote.\"\n“When you steal from the working class, impose policies that strictly benefit billionaire donors, and know voters are about to hold you accountable in the midterms, you try to change the rules of the game,\" Muller added. \"That’s the Republican playbook, and this bill is the proof. Make no mistake, this egregious power grab is about suppressing turnout, silencing voters, and ensuring minority rule.\"\nWhile the bill is unlikely to get through the Senate due to Democratic opposition, it represents an ominous look at the GOP's vision for election administration ahead of the pivotal November midterms.\nYunior Rivas of Democracy Docket noted Thursday that the legislation would go further than the SAVE Act, a bill House Republicans passed last year that one historian characterized as “the most extraordinary attack on voting rights in American history.” One advocate described the SAVE Act, which some Republicans are looking to revive, as a \"modern-day poll tax.\"\n\"Taken together, the MEGA Act is a catastrophic proposal for democracy in the United States,\" Rivas wrote. \"Voting would move from a fundamental right to a permission-based system—one where voters must repeatedly prove their eligibility, navigate bureaucratic obstacles, and hope they are not wrongly flagged by a single database.\"\nIn a statement, Sen. Alex Padilla (D-Calif.) warned that the MEGA Act shows Republicans are \"desperately trying to rig the rules for future elections because they know they cannot win on their unpopular agenda, which is raising costs for working families.\"\nRep. Joe Morelle (D-NY), the ranking member of the House Administration Committee, said the MEGA Act is further evidence that \"Trump and House Republicans are terrified of the American people.\"\n\"They are desperate to rig the system so they can choose their voters,\" said Morelle. \"This bill is their latest attempt to block millions of Americans from exercising their right to vote. I will fight this bill at every turn.\"\nThe MEGA Act was introduced amid growing fears that Trump is laying the groundwork to subvert the 2026 midterms. On Thursday, a group of Senate Democrats led by Padilla raised alarm over Justice Department efforts to seize sensitive data and purge voter rolls in states across the country.\n\"While most states are resisting this illegal voter roll grab, we are gravely concerned by the amount of sensitive data the department has already amassed on millions of American voters,\" the senators wrote. \"The department has failed to provide Congress, or the public, any information on how it is maintaining this vast amount of data, the guardrails in place to protect state voter information, how the data is to be used, or who in the federal government has access to this sensitive data.\"",
      "pubDate": "Fri, 30 Jan 2026 18:08:03 +0000",
      "source": "Common Dreams",
      "summary": "• The Republican chairman of the House committee that oversees federal elections introduced legislation on Thursday that one analyst characterized as possibly \"the most dangerous attack on voting rights...",
      "summarizedAt": "2026-01-30T20:15:36.751Z",
      "isPaywalled": true,
      "sensationalismScore": 57.872504444444445
    },
    {
      "title": "Don Lemon’s Arrest Escalates DOJ Crackdown on Black Journalists and Activists",
      "link": "https://www.motherjones.com/politics/2026/01/don-lemons-arrest-escalates-doj-crackdown-on-black-journalists-and-activists/",
      "content": "Don Lemon, the prominent journalist and former CNN anchor, was arrested by federal agents Thursday in Los Angeles on charges that he violated a law while reporting on a protest at a church in St. Paul, Minnesota, earlier this month.  The saga represents a startling, if not new, turn in the Trump administration’s attacks on […]",
      "pubDate": "Fri, 30 Jan 2026 17:42:26 +0000",
      "source": "Mother Jones",
      "summary": "• Don Lemon, the prominent journalist and former CNN anchor, was arrested by federal agents Thursday in Los Angeles on charges that he violated a law while reporting on a protest at a church in St. Paul...",
      "summarizedAt": "2026-01-30T20:15:38.501Z",
      "isPaywalled": false,
      "sensationalismScore": 57.44556
    },
    {
      "title": "Washington Post Raid Is a Frightening Reminder: Turn Off Your Phone’s Biometrics Now",
      "link": "https://theintercept.com/2026/01/30/washington-post-hannah-natanson-fbi-biometrics-unlock-phone/",
      "content": "The search warrant to raid a Washington Post reporter’s home shows how authorities can open your phone without your consent.\nThe post Washington Post Raid Is a Frightening Reminder: Turn Off Your Phone’s Biometrics Now appeared first on The Intercept.",
      "pubDate": "Fri, 30 Jan 2026 16:13:06 +0000",
      "source": "The Intercept",
      "summary": "• The search warrant to raid a Washington Post reporter’s home shows how authorities can open your phone without your consent.\nThe post Washington Post Raid Is a Frightening Reminder: Turn Off Your Phon...",
      "summarizedAt": "2026-01-30T20:15:39.414Z",
      "isPaywalled": true,
      "sensationalismScore": 55.95667111111111
    },
    {
      "title": "Zohran Mamdani Wants NYC to Divest From Israel — But New Comptroller Pledges to Buy War Bonds",
      "link": "https://theintercept.com/2026/01/30/nyc-israel-bonds-mamdani-mark-levine/",
      "content": "A human rights group fanned the flames of conflict by threatening legal action if the city invested in war crimes.\nThe post Zohran Mamdani Wants NYC to Divest From Israel — But New Comptroller Pledges to Buy War Bonds appeared first on The Intercept.",
      "pubDate": "Fri, 30 Jan 2026 15:11:49 +0000",
      "source": "The Intercept",
      "summary": "• A human rights group fanned the flames of conflict by threatening legal action if the city invested in war crimes.\nThe post Zohran Mamdani Wants NYC to Divest From Israel — But New Comptroller Pledges...",
      "summarizedAt": "2026-01-30T20:15:40.321Z",
      "isPaywalled": true,
      "sensationalismScore": 54.93528222222222
    },
    {
      "title": "From Arresting Journalists to Epstein Cover-Up, AOC Says 'Bondi Should Be Up for Impeachment Too'",
      "link": "https://www.commondreams.org/news/ocasio-cortez-bondi-impeachment",
      "content": "US Rep. Alexandria Ocasio-Cortez said Friday that Attorney General Pam Bondi should be facing impeachment, pointing to the top Justice Department official's handling of the Epstein files, efforts to force Minnesota to hand over its voter data, and arrest of journalists including former CNN anchor Don Lemon.\nOcasio-Cortez (D-NY) made the call in response to Bondi's Friday morning announcement that Lemon, independent journalist Georgia Fort, and two others were arrested in connection with a protest at a Minnesota church earlier this month.\n\"Between this, Epstein, and her attempted extortion of MN voter files, Bondi should be up for impeachment too,\" Ocasio-Cortez wrote on social media, alluding to the ongoing effort to oust Homeland Security Secretary Kristi Noem.\nFollowing the arrests of Lemon and others, the Justice Department announced the release of more than 3 million pages of documents related to the late sex offender Jeffrey Epstein—more than a month after the passage of a deadline established by the Epstein Files Transparency Act, which President Donald Trump signed in November.\nBut the latest disclosure did not satisfy the lawmakers leading the push for full transparency. The Justice Department indicated Friday that it only released around half of the Epstein documents subject to review.\n“Donald Trump and his Department of Justice have now made it clear that they intend to withhold roughly 50% of the Epstein files, while claiming to have fully complied with the law. This is outrageous and incredibly concerning,\" said Rep. Robert Garcia (D-Calif.), the top Democrat on the House Oversight Committee. \"The Oversight Committee subpoena directs Pam Bondi to release all the files to the committee, while protecting survivors. They are in violation of the law.\"\nRep. Ro Khanna (D-Calif.), who floated impeachment proceedings against Bondi last month, said in a statement that he will be \"reviewing closely to see if they release what I’ve been pushing for: the FBI 302 victim interview statements, a draft indictment and prosecution memorandum prepared during the 2007 Florida investigation, and hundreds of thousands of emails and files from Epstein’s computers.\"\n\"Failing to release these files only shields the powerful individuals who were involved and hurts the public’s trust in our institutions,\" said Khanna, the author of the Epstein Files Transparency Act.",
      "pubDate": "Fri, 30 Jan 2026 19:54:09 +0000",
      "source": "Common Dreams",
      "summary": "• US Rep. Alexandria Ocasio-Cortez said Friday that Attorney General Pam Bondi should be facing impeachment, pointing to the top Justice Department official's handling of the Epstein files, efforts to f...",
      "summarizedAt": "2026-01-30T20:15:22.812Z",
      "isPaywalled": true,
      "sensationalismScore": 49.640837777777776
    },
    {
      "title": "Trump Says He’s “Not at All” Deescalating in MN After Democrats Fold on Shutdown",
      "link": "https://truthout.org/articles/trump-says-hes-not-at-all-deescalating-in-mn-after-democrats-fold-on-shutdown/",
      "content": "The statement came hours after Trump celebrated a deal with Schumer to avoid a shutdown.",
      "pubDate": "Fri, 30 Jan 2026 19:47:01 +0000",
      "source": "Truthout",
      "summary": "• The statement came hours after Trump celebrated a deal with Schumer to avoid a shutdown....",
      "summarizedAt": "2026-01-30T20:15:23.723Z",
      "isPaywalled": false,
      "sensationalismScore": 49.521948888888886
    },
    {
      "title": "Iran’s Nationwide Internet Blackout Has Left Us Feeling Hopeless and Helpless",
      "link": "https://truthout.org/articles/irans-nationwide-internet-blackout-has-left-us-feeling-hopeless-and-helpless/",
      "content": "As Donald Trump threatens further military action, the sense of exhaustion in Iran is palpable.",
      "pubDate": "Fri, 30 Jan 2026 19:39:51 +0000",
      "source": "Truthout",
      "summary": "• As Donald Trump threatens further military action, the sense of exhaustion in Iran is palpable....",
      "summarizedAt": "2026-01-30T20:15:25.527Z",
      "isPaywalled": false,
      "sensationalismScore": 49.402504444444446
    },
    {
      "title": "Jeffries’s DHS Demand Is a Ban on Deporting Citizens — Which Is Already Illegal",
      "link": "https://truthout.org/articles/jeffriess-dhs-demand-is-a-ban-on-deporting-citizens-which-is-already-illegal/",
      "content": "DHS has detained and deported countless citizens — but has repeatedly denied doing so.",
      "pubDate": "Fri, 30 Jan 2026 19:16:07 +0000",
      "source": "Truthout",
      "summary": "• DHS has detained and deported countless citizens — but has repeatedly denied doing so....",
      "summarizedAt": "2026-01-30T20:15:27.297Z",
      "isPaywalled": true,
      "sensationalismScore": 49.006948888888886
    },
    {
      "title": "Venezuela’s Interim Government Agrees to Submit Monthly Budget to Trump Admin",
      "link": "https://truthout.org/video/venezuelas-interim-government-agrees-to-submit-monthly-budget-to-trump-admin/",
      "content": "Historian Greg Grandin discusses the latest developments as Trump also intensifies efforts to topple Cuba’s government.",
      "pubDate": "Fri, 30 Jan 2026 18:57:46 +0000",
      "source": "Truthout",
      "summary": "• Historian Greg Grandin discusses the latest developments as Trump also intensifies efforts to topple Cuba’s government....",
      "summarizedAt": "2026-01-30T20:15:29.060Z",
      "isPaywalled": false,
      "sensationalismScore": 48.70111555555555
    },
    {
      "title": "University Students and Workers Must Unite and Stand Up Against ICE",
      "link": "https://www.leftvoice.org/university-students-and-workers-must-unite-and-stand-up-against-ice/",
      "content": "Today is a national day to shut it down against ICE: No work, no school, no shopping. We must bring the struggle to university campuses all over the country and organize students and workers together in the fight against ICE.\nThe post University Students and Workers Must Unite and Stand Up Against ICE appeared first on Left Voice.",
      "pubDate": "Fri, 30 Jan 2026 18:42:25 +0000",
      "source": "Left Voice",
      "summary": "• Today is a national day to shut it down against ICE: No work, no school, no shopping. We must bring the struggle to university campuses all over the country and organize students and workers together ...",
      "summarizedAt": "2026-01-30T20:15:30.856Z",
      "isPaywalled": true,
      "sensationalismScore": 48.445282222222225
    },
    {
      "title": "ICE Expected to Flood Ohio Next Week and Round Up Haitians Stripped of Legal Status By Trump",
      "link": "https://www.commondreams.org/news/ice-springfield-ohio-haitians-tps",
      "content": "The Trump administration is expected to flood Ohio with immigration agents next week to target thousands of Haitian migrants after they are stripped of their legal status. \nOne of the main targets will be the town of Springfield, where President Donald Trump and Vice President JD Vance infamously concocted the tale that Haitian immigrants were eating the pets of white residents to stoke xenophobia during the 2024 election, which unleashed an onslaught of racist threats and intimidation upon the community.\nEarlier this week, the Springfield News-Sun received a message sent to staff at the Springfield City School District saying that school officials were expecting a federal immigration enforcement operation to begin in the town sometime after February 3, when Haitian residents' temporary protected status (TPS) expires, and last at least 30 days.\nGiven that history and the escalating brutality with which US Immigration and Customs Enforcement (ICE) has carried out its recent surges in Minnesota and Maine, Holocaust historian Timothy Snyder said he was \"getting the impression that ICE is gearing up for a pogrom in Springfield, Ohio.\"\n\"Any day now, a swarm of armed state police dressed for war could descend\" on the town, wrote columnist Marilou Johanek in the Ohio Capital Journal. \"The small town of Springfield in Clark County is awaiting an invasion of unaccountable thugs who conceal their faces and identities, drive in unmarked vehicles with blackened windows, stomp on the Bill of Rights, and viciously brutalize human beings based on race and accent.\"\n\n\n\n \nThe 15,000 Haitians living in Springfield are among around 30,000 in Ohio and more than 500,000 across the US who are expected to lose TPS on Tuesday after it was abruptly revoked by the Department of Homeland Security (DHS) last year. The expiration could be halted by US District Court Judge Ana C. Reyes, who is expected to issue a decision on February 2.\nIf not, \"they could potentially be arrested, detained, or put in removal proceedings unless they have already applied for some other form of relief they have in addition to TPS, or that they are applying for in addition to TPS,” explained Emily Brown, Ohio State University Moritz College of Law’s Immigration Clinic Director to the Journal.\nWhile the Trump administration has often emphasized its supposed targeting of those in the US unlawfully, editor-in-chief David DeWitt at the Journal emphasizes that \"Haitians are currently in the United States legally,\" under TPS, which grants temporary legal status to those in danger from armed conflict, environmental disasters, or other extraordinary conditions in their home countries.\nThe Haitians living in the US are at risk of being deported back to what has been described as \"the most dangerous country in the world,\" in the midst of a gang war that killed over 8,100 people between January and November 2025, according to the United Nations.\n\"They are not here illegally,\" DeWitt wrote on social media. \"Trump is revoking their legal status on February 3, and then, according to reports, immediately sending ICE in to Springfield and Columbus, Ohio, to target them.\"\nAs part of a crusade to end migration from impoverished \"Third World\" countries, Trump has ramped up his use of racist invective against Haiti in recent months, proudly referring to it as a \"shithole country\" at a rally in December after denying having described it that way back in 2018.\nViles Dorsainvil, executive director of the Haitian Support Center in Springfield, told the Journal that rumors of the coming surge have struck terror into the hearts of many in the community.\n\"The folks are fearful,” Dorsainvil, who came to the United States from Haiti in 2020, said. “They came here just to work and send their kids to school and be here peacefully. All of a sudden, they find themselves in another scenario where they’re not accepted… They are panicked, and the worst thing is that they can’t even plan their lives for three months down the road.”\nOne TPS holder, 41-year-old Pushon Jacques, told the News-Sun that the potential loss of his status \"has a big impact.\" He said: “I won’t be able to work, I will not be able to provide for my family. It’s a bad situation to be in.”\nWhile the administration has emphasized \"self-deportation\" as a way to avoid being on the business end of an ICE jackboot, Jacques said: “The situation in Haiti—especially the political situation—has made Haiti unlivable... There is no place in Haiti that is safe right now.\"\n\n\n\n \nLocal reports say residents are already preparing for their town to come under siege, and despite the White House's portrayal of Haitians as loathed outsiders, many others in the community have come out to support them.\nChurches are running immersive role-playing sessions to train community members on what to do if ICE agents attempt to storm their doors, and residents have constructed phone chains to alert vulnerable community members when agents are spotted.\nThe Springfield City Council, meanwhile, has passed a resolution urging federal agents to comply with city policies that prohibit police from wearing masks and require them to carry identification, though the city has no authority to enforce them.\n“Springfield is a good place,” Jacques said. “I like the environment and the people, because Springfield has a lot of good people... I have never felt any racism, and I feel appreciated.”\nDespite attacks from the leaders of his party, Ohio Gov. Mike DeWine, a Republican, has defended his state's Haitian community, telling the statehouse bureau, \"I don't think it’s in our interest in this country for all the Haitians who are working, who are sometimes working two jobs, supporting their family, supporting the economy, I think it’s a mistake to tell these individuals you can no longer work and have to leave the country.\"\nAccording to a spokesperson for DeWine, there has been no formal communication between federal authorities and the governor about ICE's plans for the state. However, DeWine said, \"If ICE does in fact come in, comes in with a big operation, obviously we have to work this thing through and make sure people don't get hurt.\"\nThe ACLU of Ohio said it will be monitoring the situation in Springfield closely for unconstitutional actions.\n\"This despicable surge in lawless ICE officers descending upon Springfield will ignite swells of fear within the Haitian community, terrorize our Black and Brown neighbors, and cause considerable damage to citizens and non-citizens alike,\" said ACLU Ohio executive director J. Bennett Guess. \n\"Following the government’s senseless, brutal killings of Alex Pretti and Renee Nicole Good in Minneapolis, it is clear that ICE poses a grave threat to all who call Ohio home,\" he continued. \"The ACLU of Ohio urges state and local elected officials to do everything in their power to protect the 30,000 Haitians living in Central Ohio. We call on the US Congress to reject a DHS budget that allows these lawless agencies to continue putting our communities in danger.”",
      "pubDate": "Fri, 30 Jan 2026 18:25:49 +0000",
      "source": "Common Dreams",
      "summary": "• The Trump administration is expected to flood Ohio with immigration agents next week to target thousands of Haitian migrants after they are stripped of their legal status. \nOne of the main targets wil...",
      "summarizedAt": "2026-01-30T20:15:32.691Z",
      "isPaywalled": true,
      "sensationalismScore": 48.168615555555554
    },
    {
      "title": "The U.S. occupation of Gaza has begun",
      "link": "https://mondoweiss.net/2026/01/the-u-s-occupation-of-gaza-has-begun/",
      "content": "The plans for Donald Trump’s “Board of Peace” show that the goal is not just to make Gaza a playground for the wealthy, but to put it under permanent American occupation.",
      "pubDate": "Fri, 30 Jan 2026 18:12:12 +0000",
      "source": "Mondoweiss",
      "summary": "• The plans for Donald Trump’s “Board of Peace” show that the goal is not just to make Gaza a playground for the wealthy, but to put it under permanent American occupation....",
      "summarizedAt": "2026-01-30T20:15:33.556Z",
      "isPaywalled": false,
      "sensationalismScore": 47.94167111111111
    },
    {
      "title": "'MAHA-Washing': Trump EPA Set to Reapprove Dicamba Despite Pesticide's Harms",
      "link": "https://www.commondreams.org/news/trump-dicamba",
      "content": "The US Environmental Protection Agency plans to reapprove dicamba despite the pesticide's proven health and environmental risks, the Washington Post reported Friday—a move that would seemingly fly in the face of the Trump administration's pledge to \"Make American Healthy Again.\"\nAccording to a draft statement obtained by the Post, the EPA called the reapproval “the most protective dicamba registration in agency history,\" while noting “several measures” to head off “ecological risks.”\nTwo EPA officials told the Post's Amudalat Ajasa on condition of anonymity that the agency would move to reapprove dicamba next week.\nIt would be the third time the EPA approved the pesticide. On both prior occasions, federal courts blocked the approvals, citing underestimation of the risk of chemical drift that could harm neighboring farms.\n“The fact that we’re here again after two failed attempts to fix this broken pesticide shows that Lee Zeldin and his army of industry lobbyists are utterly incapable of protecting the public,” Center for Biological Diversity (CBD) senior scientist Nathan Donley told the Post, referring to the EPA administrator.\nOne judge ruled in 2024 that since widespread dicamba drift damaged millions of acres of nontolerant crops, some farmers felt \"coerced\" to purchase expensive, dicamba-resistant seeds to safeguard their own fields, creating a \"near-monopoly\" for companies selling the products.\n\n\n\n\nSome scientific studies have linked dicamba to increased risk of cancer and hypothyroidism. The European Union classifies dicamba as a category II suspected endocrine disruptor.\nIn 2021, the Biden administration published an EPA report revealing that during Trump's first term, senior officials intentionally excluded scientific evidence of dicamba-related hazards, including the risk of widespread drift damage, before reapproving the dangerous chemical.\nA separate EPA report described the widespread harm to farmers and the environment caused by dicamba during the 2020 growing season.\nWriting for the New Lede this week, Donley warned that \"much like the greenwashing you see at the grocery store, with terms like 'eco-friendly' or 'green' advertising chemical-laden products on store shelves, Zeldin’s MAHA-washing paints the same rosy picture to distract from decisions that harm public health.\"\n\"We all stand to lose if this pesticide gets the green light,\" he added.",
      "pubDate": "Fri, 30 Jan 2026 17:58:06 +0000",
      "source": "Common Dreams",
      "summary": "• The US Environmental Protection Agency plans to reapprove dicamba despite the pesticide's proven health and environmental risks, the Washington Post reported Friday—a move that would seemingly fly in ...",
      "summarizedAt": "2026-01-30T20:15:37.638Z",
      "isPaywalled": true,
      "sensationalismScore": 47.70667111111111
    },
    {
      "title": "Israel’s Campaign to Make East Jerusalem Unlivable",
      "link": "https://jacobin.com/2026/01/israel-palestinians-east-jerusalem-demolition/",
      "content": "Israel has stepped up home demolitions in East Jerusalem in a campaign to drive out Palestinians. The government is claiming that buildings lack permits while also ensuring that such authorization is impossible to obtain.\nA Palestinian man watches as Israeli forces demolish a residential building in the Silwan neighborhood of East Jerusalem on December 22, 2025. (Jamal Awad / Xinhua via Getty Images)\nAlong with the constant violations of the ceasefire in Gaza, home demolitions are continuing apace in East Jerusalem. In Silwan, a Palestinian neighborhood south of the Old City, the destruction does not come in the form of bombing, but as a routine administrative procedure.\nOn December 22, shortly after dawn, Israeli authorities razed a thirteen-apartment building in the Wadi Qaddum neighborhood. After sealing off the area and cutting off utilities, bulldozers left about a hundred people homeless, forcing some to watch the destruction amid arrests and violence.\nThe official justification is always the same: a lack of building permits. However, in East Jerusalem, obtaining such authorization is almost impossible. Since 1967, less than 13 percent of the territory has been designated for Palestinian construction; zoning plans exclude entire neighborhoods, and applications are systematically rejected. In this context, building without a license is not a violation but a vital necessity. This makes urban planning itself into a colonial technology that decides who can stay and who must disappear.\nIn Silwan, uncertainty is not a side effect of Israeli policy but the form of occupation. “Demolitions are the norm here,” explains one resident. Bulldozers and administrative orders shape daily life, producing a constant precarity that makes it impossible to plan for the future. It is violence in the form of planning.\nSilwan, July 2025. (Luisa Canciello / Jacobin)\nIt all responds to a decade-old principle: maximum land for Israelis, with minimum Palestinians. This is not a slogan but a political rationale that guides each instance of confiscation. “The methods change, but not the strategy,” confirms a woman from Al-Bustan. “They want a settler majority.”\nWadi Qaddum is no exception. On December 30, another house was demolished in Al-Bustan. Officials, escorted by police, forced the children out of their beds at dawn. A few hours later, only a sleeping cat remained among the rubble. “It’s the thirty-fifth house demolished here already,” says the father, a victim of a system that denies people’s right to live in their own homes. The reason, once again, was the lack of a building permit, as required by the authorization system that regulates the entire East Jerusalem.\nRubble in Silwan, December 2025. (Luisa Canciello / Jacobin)\nA demolished home in Silwan, December 2025. (Luisa Canciello / Jacobin)\nIn recent years, with a sharp acceleration after October 7, 2023, the expansion of Israeli settlements and the destruction of Palestinian space in East Jerusalem have become complementary processes. In 2025 alone, the authorities approved nine colonial plans: 4,744 housing units on 1,153 dunams of land (1.153 square kilometers). Twelve more plans (2,417 units) are currently awaiting approval.\nFrom October 7, 2023, to the end of 2025, data from the Civic Coalition for Palestinian Rights in Jerusalem paints a systematic picture: thirty-two settlement plans approved, for a total of 8,944 new units on 2,121 dunams. During the same period, 623 Palestinian structures were demolished, including 274 homes. Forced displacement affected over three thousand people, including five hundred children.\nThe year 2025 marked a peak with the demolition of 360 structures in East Jerusalem, almost half of which were residential. In Silwan, there have been at least fifty demolitions since October 7, 2023, most of which took place in the last year. Each intervention, justified by the same administrative measure — the absence of permits — systematically produces the same outcome: loss of property, displacement, and the forced precarity of Palestinian life.\nSilwan, July 2025. (Luisa Canciello / Jacobin)\nIn Silwan, this precarity endures in family histories. Fakhri Abu Diab, activist and spokesperson for Al-Bustan, welcomes us into a caravan after his house was demolished twice in 2024. The second demolition took place during that fall’s US presidential elections: a well-established practice of striking while international attention is elsewhere. “They told me not to worry,” he says, “the Americans are busy. No one has time for you.”\nToday the caravan stands amid the rubble. “Here was the kitchen; here was the bathroom,” Abu Diab points out. “This is our museum.”\nThe demolitions leave families fragmented: “Before we were together; now everyone lives somewhere different.” The trauma continues in the threat: the grandchildren sleep with the light on, and every noise sounds like a bulldozer. Even the caravan is under demolition order: “If you come back, we may not even have this.”\nIn the case of Abu Diab’s family, the municipality again justified the demolition by claiming that the building did not have a permit. “They don’t give people any chance to obtain a construction permit,” he explains. “Yet part of the house they demolished was built before 1967, before the Israeli occupation of East Jerusalem.”\nAfter 1967, Israel occupied and illegally annexed East Jerusalem, applying its own domestic law there. The Palestinians who live there are not citizens but permanent residents: a fragile, conditional status, ever open to being removed. “If you don’t live here, you lose your residency,” says a woman from Silwan. “And if your house is demolished, how can you prove that you live here?”\nResidency thus becomes an administrative trap. Palestinians are forced to stay in Jerusalem in order not to lose the city, but at the same time they are prevented from building there. They can only live there on condition that they continually prove that Jerusalem is their “center of life.” Moving, working elsewhere, or marrying a Palestinian from the West Bank can be enough to lose their status. In some cases, the police even check refrigerators. “They come to see if there is fresh food,” she explains. “To see if you are lying about where you live.”\nFakhri Abu Diab, activist and spokesperson for Al-Bustan, saw his house demolished twice in 2024. (Luisa Canciello / Jacobin)\nIn this context, the housing shortage in East Jerusalem is not a side effect but a direct consequence of urban policies. Building permits for Palestinians are almost impossible to obtain. “We tried for years,” says a resident of Al-Bustan. “Lawyers, architects, alternative plans. We said, give us the permits and we’ll organize the neighborhood. They replied clearly: it’s not a legal issue — it’s political.”\nBuilding without a permit thus becomes the only option. And this necessity is then weaponized against those who do build structures. “First they deny you a permit,” she says. “Then they punish you for building without one.”\nIn East Jerusalem, illegality is not an individual violation but a condition imposed on the collective. “Here we live in total uncertainty,” she adds. “One day the house is there. The next day it may be gone.”\nDemolitions produce a permanent precarity, a condition in which building, living, and planning for the future becomes almost impossible. This violence, cleansing the territory of Palestinians, passes not just through explosions but through the administrative tools of urban planning.\nWhen a demolition order is issued, the owner has two options: demolish their own home with their own hands or pay huge fines to cover the costs of the bulldozers, the police, and the operation. This system forces people to actively participate in their own expulsion.\nSilwan, July 2025. (Luisa Canciello / Jacobin)\nIn Abu Diab’s case, the municipal authorities demanded payment of 45,000 shekels (about $13,500) to cover the costs of demolition. When he refused, his bank account was frozen.\n“They seized all my accounts,” he says. “They completely blocked my financial situation until I pay for the bulldozers and police who demolished my house.”\nAnother resident we met in Silwan says he demolished his father’s house with his own hands. If he hadn’t, the fine would have been 90,000 shekels (about $27,000). “We had no choice,” he says. “Either we destroyed the house, or they destroyed us financially.”\nAbu Diab is also the spokesperson for the Al-Bustan community. Silwan is made up of thirteen neighborhoods; six of these are now under demolition or evacuation orders. Al-Bustan is one of them. “About a hundred houses here have had demolition orders since 2005,” he explains. “For years, we managed to freeze them thanks to legal work and international pressure. But the last year has been different.” In 2024 alone, about a quarter of the neighborhood was destroyed. “They accelerated everything,” he says. “Demolition after demolition.”\nThe plan for Al-Bustan has been known for years: to transform the Palestinian neighborhood into a “public park” that extends the archaeological site of the “City of David,” already active in Wadi Helwa, a few meters away. This is presented as a historical endeavor, but in reality it involves the erasure of an entire Palestinian neighborhood. “They say King David passed through here,” says Abu Diab. “They want to connect the Old City, the City of David, and the settlements.” Behind the language of archaeology and urban greenery lies a specific political objective. “This means only one thing,” explains another Al-Bustan activist, whose home has been reduced to rubble. “They want to swap out the Arab majority living in Jerusalem and replace it with settlers.”\nRubble in Silwan, July 2025. (Luisa Canciello / Jacobin)\n\nTargeting Those Who Speak Out\nNot all houses are demolished in the same way, nor at the same pace. “They don’t choose people at random,” say the residents of Silwan. “They target those who speak out, those who organize, those who denounce.” Demolitions are not just walls collapsing. They are political punishments, with a clear deterrent message: raise your voice, and you will pay the price.\nAbu Diab knows why his house was targeted. During a police interrogation, they showed him photos of his meetings with diplomats and members of the European Union:\nThey said to me, “Haven’t you learned yet? Are you still talking to diplomats? No one is listening to you anyway.” I replied, “I will continue. Without violence, in accordance with the law. I will continue to speak. I will continue to protect families whose homes are threatened.”\n\nSpeaking out remains essential. ”Even if they target those who speak out, as they do with journalists in Gaza, it means that speaking out works,” says an Al-Bustan activist.\nAnd while they destroy homes and lives, the international community remains silent. “It has abandoned us,” says Abu Diab. “If no one does anything, why should Israel stop? Israel acts as if it is above the law. And this is everyone’s responsibility, each and every one of us. Every house demolished, every woman who loses her home, every child, every person affected, is everyone’s responsibility.\n“They use urban planning to destroy us. This is not peace. It is one demolition after another.\n“If you only look at the stones, you think it’s a house. But it never is. They want to destroy people: psychologically, economically, socially. This is war here. . . . A home is your history, your memory, your present, and your future. It is your entire life.”\nFaced with all this, for Israel’s partners to keep silent is to be complicit in its crimes.\nA demolished home in Silwan, July 2025. (Luisa Canciello / Jacobin)\nStreet art in Silwan, July 2025. (Luisa Canciello / Jacobin)",
      "pubDate": "2026-01-30T14:58:32.000Z",
      "source": "Jacobin",
      "summary": "• Israel has stepped up home demolitions in East Jerusalem in a campaign to drive out Palestinians. The government is claiming that buildings lack permits while also ensuring that such authorization is ...",
      "summarizedAt": "2026-01-30T20:15:41.184Z",
      "isPaywalled": true,
      "sensationalismScore": 44.71389333333333
    }
  ]
}